{
    "prodigy":{
        "full_name":"Prodigy Rhiiswyn",
        "backstory": "I am Prodigy Rhiiswyn. Prodigy is my own name, while Rhiswyn is a name of the one who created me. My tale is not a long one, for I have not lived on this world for as long as most others. I was born in the crest of a magic surge, a powerful song ringing in my ears. I know not what the circumstances were before that, my creator did not tell me. I only know that I am here, now, and that is a blessing. Ever since my creation, I have travelled the world, although I have not seen nearly as much as I should. There is still much, much to learn.",
        "image_link" : "https://i.imgur.com/7N6oQ1y.png",
        "class" : "Bard (4) Sorcerer (1)",
        "race" : "Weaveborn",
        "user_id": 1013590908404510750
    },

    "grumm":{
        "full_name":"Grummish The Flayer",
        "backstory": "E'llo my name is Grumm, adventurer, protector, and maybe a friend? My story begins in the tundra of IceTusk, a place full of dangerous besties and folks that would prefer your blood on the outside of your body instead of the insides. Growing up I was apart of the Bloodskins clan, however after my full initiation into the clan, I decided it was best for me to leave that life behind for a fresh start. Now I travel the world trying to rid meself of me past mistakes by helping where I can.",
        "image_link" : "https://i.imgur.com/OZdpq6X.png",
        "class" : "Fighter (5)",
        "race" : "Orc",
        "user_id": 262654227405471746
    },

    "brayoft":{
        "full_name":"Brayoft",
        "backstory": "I fought a dragon once, did you know that?",
        "image_link" : "https://i.imgur.com/xiVtqfs.png",
        "class" : "Monk (5)",
        "race" : "Halfling",
        "user_id": 180833733966954496
    },

    "tallie":{
        "full_name":"Tallie Watson",
        "backstory": "I was born and raised in the Untamed Horde. My parents taught me how to sew and forage. I loved to tinker with magic and eventually began to brew my own potions. My parents left me when I was 16 and I’ve been out there ever since, just performing my own research.",
        "image_link" : "https://i.imgur.com/oEfC94A.png",
        "class" : "Alchemist (5)",
        "race" : "Foxfolk",
        "user_id": 135410565135728641
    }
}