{
    "apprentice": {
        "normal": [
            "usr1 blasts usr2.",
            "usr1 blasts usr2 with a fireball, burning away their bdypart.",
            "usr1 fires an arcane beam into usr2's bdypart! Goodbye, bdypart!",
            "usr1 is practicing their magic when usr2 walks across the firing range. The only thing left is a pile of dust and usr2's bdypart.",
            "usr1 creates a blizzard, completely freezing usr2.",
            "usr1 beats usr2 to death with their spellbook.",
            "usr1 stands across from usr2.\n\n'So, usr2... we meet again.'\n\n'So it seems.'\n\n'I've been practicing. All this time, day after day. You stand no chance.'\n\nusr2 laughs. 'Yeah, I bet.'\n\nusr1 then focuses their magic to summon a giant spike constructed of earth. usr2's eyes go wide. They begin to run. It is futile. usr1's shard of earth slams into usr2, completely obliterating them. usr1 smiles. They did it.",
            "usr1 shoots 100 shards of thin ice into usr2's bdypart. They collapse, dead.",
            "usr1 traps usr2 in a stone sphere, then rolls them into a volcano. Bye bye!",
            "usr1 strikes usr2 with lighting. Zap!"
        ],
        "crit": [
            "usr1 channels the essence of ancient mages, unleashing a cataclysmic burst of pure energy that rips usr2 apart, especially their bdypart.",
            "With a flick of their wrist, usr1 manipulates the elements, causing the ground beneath usr2 to swallow them whole, crushing their bdypart.",
            "usr1 whispers an eldritch incantation, twisting usr2's reality until they implode into a singularity, annihilating their bdypart.",
            "Channeling the fury of a storm, usr1 strikes usr2 with a bolt of lightning that turns them into a smoldering crater, specifically obliterating their bdypart.",
            "usr1 conjures a spectral dragon that devours usr2 whole, focusing particularly on their bdypart.",
            "The air crackles as usr1 summons a vortex of fire that engulfs usr2, reducing them to ashes, with a focus on their bdypart.",
            "In a display of raw power, usr1 rips the fabric of space, drawing usr2 into an endless void, tearing their bdypart apart first.",
            "usr1's eyes glow with power as they summon a meteor from the cosmos to crush usr2, targeting their bdypart.",
            "Frozen in time, usr2 watches helplessly as usr1 orchestrates a symphony of destruction that tears them apart molecule by molecule, starting with their bdypart.",
            "usr1 unleashes a barrage of arcane missiles that hone in on usr2, each impact specifically targeting their bdypart."
        ]
    },
    "swordsman": {
        "normal": [
            "usr1 slashes at usr2, cutting deep into their bdypart.",
            "usr1 executes a series of rapid strikes, overwhelming usr2 and severing their bdypart.",
            "With a swift move, usr1 disarms usr2 and follows up with a clean cut across their bdypart.",
            "usr1 parries an attack from usr2 and counters with a devastating blow to usr2's bdypart.",
            "In a display of swordsmanship, usr1 dances around usr2, striking them precisely in their bdypart.",
            "usr1 charges at usr2, thrusting their sword through usr2's bdypart.",
            "usr1 uses a spinning attack, slicing usr2 multiple times, especially targeting their bdypart.",
            "usr1 leaps into the air, bringing their sword down on usr2 with incredible force, cleaving their bdypart.",
            "usr1 catches usr2 off guard, delivering a swift, lethal stab to their bdypart.",
            "usr1 performs a perfect lunge, piercing usr2's bdypart cleanly."
        ],
        "crit": [
            "usr1's blade glows with an eerie light as they deliver a strike that cleaves usr2 in two, particularly their bdypart.",
            "With unmatched precision, usr1 finds a gap in usr2's armor and exploits it brutally, slicing through their bdypart.",
            "usr1's sword sings through the air, cutting through usr2 as if they were made of butter, particularly severing their bdypart.",
            "In a legendary display of skill, usr1 decapitates usr2 with a single, clean swipe, targeting the neck as the bdypart.",
            "usr1 performs an ancient sword technique, rending usr2's bdypart from their body in a spray of blood.",
            "Like a scene from a myth, usr1's sword strike causes a shockwave, blasting usr2 away, with their bdypart taking the brunt of the force.",
            "usr1's critical hit sends usr2 flying, their body crashing into the distance, especially damaging their bdypart.",
            "With a roar, usr1 unleashes a mighty blow that dismembers usr2's bdypart with sheer force."
        ]
    },
    "archer": {
        "normal": [
            "usr1 fires an arrow that precisely hits usr2's bdypart.",
            "usr1 unleashes a flurry of arrows, one of which finds its mark in usr2's bdypart.",
            "With deadly accuracy, usr1 shoots an arrow through usr2's bdypart from a great distance.",
            "usr1's arrow whistles through the air, embedding itself in usr2's bdypart.",
            "In a rapid display of archery, usr1 sends multiple arrows flying, each striking usr2, particularly in their bdypart.",
            "usr1 takes aim and lets loose an arrow that splits usr2's previous wound on their bdypart.",
            "usr1 fires a barbed arrow, which hooks into usr2's bdypart, causing immense pain.",
            "From the shadows, usr1 shoots an arrow that pierces through the air, landing squarely in usr2's bdypart.",
            "usr1's arrow arcs beautifully through the sky before descending sharply into usr2's bdypart.",
            "usr1 lines up a perfect shot, the arrow zipping straight into usr2's bdypart with lethal precision."
        ],
        "crit": [
            "usr1 releases a special arrow infused with explosive magic, detonating on impact and obliterating usr2's bdypart.",
            "With a whisper of wind, usr1's arrow transforms mid-flight into a spectral falcon, tearing through usr2's bdypart.",
            "usr1's arrow carries with it a curse, causing usr2's bdypart to decay rapidly upon impact.",
            "An arrow of pure light shoots from usr1's bow, piercing through usr2 and leaving a glowing hole in their bdypart.",
            "usr1's critical shot is so precise that the arrow splits usr2's bdypart into two symmetric halves.",
            "The arrow released by usr1 is guided by the spirits of past archers, finding its deadly home in usr2's bdypart.",
            "usr1's enchanted arrow causes thunder to clap as it strikes usr2's bdypart, the impact echoing like thunder.",
            "With uncanny precision, usr1 fires an arrow that spirals through the air, drilling through usr2's bdypart.",
            "usr1's arrow is tipped with a rare poison, which immediately paralyzes usr2's bdypart upon entry.",
            "A mythical arrow, said to never miss, is loosed by usr1 and finds its destiny in usr2's bdypart."
        ]
    },
    "rogue": {
        "normal": [
            "usr1 stealthily approaches usr2 and delivers a swift stab to their bdypart.",
            "From the shadows, usr1 strikes at usr2, their dagger slicing cleanly through usr2's bdypart.",
            "usr1 uses a smoke bomb to disorient usr2, then quickly slashes their bdypart.",
            "With a flick of the wrist, usr1 throws a dagger that embeds itself in usr2's bdypart.",
            "usr1 performs a cunning feint, followed by a precise cut to usr2's bdypart.",
            "usr1 slips behind usr2 unnoticed and drives a knife deep into their bdypart.",
            "usr1's swift movements are a blur as they dart in and slice usr2's bdypart.",
            "Using the environment to their advantage, usr1 ambushes usr2, targeting their bdypart.",
            "usr1's low sweep catches usr2 off-guard, injuring their bdypart severely.",
            "In a display of agility, usr1 vaults over usr2, striking down hard on their bdypart."
        ],
        "crit": [
            "usr1 executes a masterful backstab that completely severs usr2's bdypart, leaving a gory spectacle.",
            "In a moment of perfect stealth, usr1 delivers a crippling blow to usr2's bdypart, rendering it useless.",
            "usr1's dagger glints ominously before it finds a home in usr2's bdypart, the strike silent but deadly.",
            "With a calculated move, usr1's throw sends a dagger spinning through the air, embedding deeply in usr2's bdypart.",
            "As quick as a shadow, usr1 slips through usr2's defenses, their blade slicing critical tendons in usr2's bdypart.",
            "usr1's precise strike not only injures usr2 but also plants a slow-acting poison, starting at the bdypart.",
            "A sudden flash of light marks usr1's critical move, a swift strike that almost bisects usr2's bdypart.",
            "With deadly precision, usr1 aims and hits a vital point on usr2's bdypart, the pain immediate and overwhelming.",
            "usr1 combines agility with deadly intent, their critical hit puncturing an artery in usr2's bdypart.",
            "The air hums as usr1 moves faster than the eye can follow, their strike devastatingly precise on usr2's bdypart."
        ]
    },
    "dark mage": {
        "normal": [
            "usr1 envelops usr2 in shadows, making them vanish except for their bdypart.",
            "With a sinister laugh, usr1 sends a swarm of dark spirits to torment usr2, focusing on their bdypart.",
            "usr1 conjures a vortex of dark energy around usr2, slowly disintegrating their bdypart.",
            "usr1 mutters a curse, and suddenly usr2's shadow rises up, strangling them with icy fingers.",
            "In a sudden display of dark power, usr1 blasts usr2 with a beam of shadow energy, targeting their bdypart.",
            "usr1 creates a localized eclipse above usr2, plunging them into darkness and terror.",
            "Dark tendrils erupt from usr1's hands, wrapping around usr2 and squeezing tightly until they collapse.",
            "usr1's eyes glow red as they summon a spectral wolf that viciously attacks usr2, mauling their bdypart.",
            "With a flick of their wrist, usr1 casts a spell of decay, causing usr2's bdypart to wither instantly.",
            "usr1 whispers a dark incantation, causing the ground beneath usr2 to swallow them up."
        ],
        "crit": [
            "usr1 channels the darkest magics, creating a black hole at usr2's feet that devours them, focusing particularly on their bdypart.",
            "usr1 performs a forbidden ritual, summoning a demon that tears usr2 apart, starting with their bdypart.",
            "The air chills as usr1 calls forth the ancient curse of the abyss, which clings to usr2, particularly devouring their bdypart.",
            "usr1 raises their hands, and a rain of dark meteors falls upon usr2, pulverizing their bdypart specifically.",
            "Darkness swells as usr1 conjures a massive phantom serpent that swallows usr2 whole, crushing their bdypart first.",
            "In a terrifying display, usr1 summons the spirits of the damned to torment usr2, tearing at their bdypart relentlessly.",
            "usr1's spell cracks reality itself, opening a void beneath usr2 that drags them into oblivion, focusing on their bdypart.",
            "A horde of shadows rises at usr1's command, converging on usr2 and tearing them apart, starting with their bdypart.",
            "usr1 summons the night itself to engulf usr2, who is slowly consumed by creeping darkness, particularly at their bdypart.",
            "With a powerful incantation, usr1 unleashes an explosion of dark energy that annihilates usr2, obliterating their bdypart first."
        ]
    },
    "pyromancer": {
        "normal": [
            "usr1 ignites a small flame that quickly engulfs usr2, singeing their bdypart in a surprising twist.",
            "With a snap of their fingers, usr1 sends a fireball hurling towards usr2, catching them squarely in the bdypart.",
            "usr1 draws a fiery rune in the air, which explodes into a burst of flames, especially around usr2's bdypart.",
            "The ground beneath usr2 heats up as usr1 channels molten lava to surface, burning more than just their feet.",
            "usr1 throws a handful of spark dust into the air, igniting a firestorm that dances dangerously close to usr2's bdypart.",
            "usr1 whispers an incantation, superheating the air which singes usr2, with their bdypart feeling it most.",
            "Flames dance around usr1's hands before being thrust forward, enveloping usr2 with intense heat around their bdypart.",
            "usr1's eyes glow with fiery energy as a phoenix swoops at usr2, focusing its fiery wrath on their bdypart.",
            "usr1 creates a ring of fire that traps and scorches usr2, with their bdypart feeling the heat intensely.",
            "usr1 claps their hands together, causing an explosion of flame right beneath usr2, engulfing their bdypart."
        ],
        "crit": [
            "usr1 channels a volcanic eruption, unleashing a catastrophic blast that consumes usr2, focusing intensely on their bdypart.",
            "usr1 summons a dragon made of flames that breathes fire across usr2's body, with their bdypart burning fiercely.",
            "Inferno spells crack the ground beneath usr2, with flames leaping up to devour their bdypart particularly.",
            "A massive firestorm surrounds usr2, burning everything, but their bdypart suffers the worst.",
            "Fire rains from the sky, each ember burning usr2 with particular ferocity at their bdypart.",
            "usr1 turns air moisture into scalding steam around usr2, focusing the scorching heat on their bdypart.",
            "usr1 calls upon the sun's wrath, focusing its fiery gaze directly on usr2's bdypart, crisping it thoroughly.",
            "usr1 causes the air around usr2 to ignite, vaporizing them with a focus on their bdypart.",
            "usr1 releases flames that spiral and wrap around usr2, incinerating them with a focus on their bdypart.",
            "usr1 commands the ground to split, and a pillar of fire shoots up, particularly enveloping usr2's bdypart."
        ],
        "overheat": [
            "usr1's magic becomes unstable, erupting in fire that chars usr2, particularly their bdypart.",
            "usr1 overheats, sending sparks flying that singe usr2's bdypart specifically.",
            "A burst of mini explosions catches usr2 as usr1 overheats, focusing on their bdypart.",
            "usr1's spell backfires, resulting in a burst of flame that scorches usr2's bdypart intensely.",
            "usr1's temperature spikes, releasing a shockwave that mainly affects usr2's bdypart.",
            "usr1 accidentally ignites the surrounding oxygen, causing a flash fire that burns usr2's bdypart.",
            "A misfired spell results in an explosion, sending a wave of heat towards usr2, particularly affecting their bdypart.",
            "usr1 loses control, and a flare-up sends a fireball that targets usr2's bdypart.",
            "usr1's energy peaks and bursts, creating sparks that focus on singeing usr2's bdypart."
        ]
    },
    "hydromancer": {
        "normal": [
            "usr1 conjures a swirling water orb that splashes violently onto usr2, soaking their bdypart.",
            "With a wave of their hand, usr1 sends a jet of water striking usr2, aiming directly at their bdypart.",
            "usr1 summons a rain cloud directly above usr2, drenching them thoroughly, with a heavy pour on their bdypart.",
            "A geyser erupts from beneath usr2 as usr1 manipulates underground water sources.",
            "usr1 flicks their wrist, causing a burst of water to form into icy shards mid-air, pelting usr2, focusing on their bdypart.",
            "The air around usr2 chills as usr1 freezes the moisture, creating a frost that bites especially at their bdypart.",
            "usr1 crafts a whip made of water, snapping it towards usr2, the tip striking their bdypart with precision.",
            "With a forceful stomp, usr1 causes a wave to rise from the ground, crashing over usr2 with a focus on their bdypart.",
            "usr1 gestures dramatically, and a circle of water rises, entrapping usr2 and then crashing inward.",
            "usr1's hands glow blue as they summon a powerful water vortex, sweeping usr2 off their feet and swirling around their bdypart."
        ],
        "crit": [
            "usr1 calls upon the deepest oceans, summoning a tidal wave that engulfs usr2, overwhelming their bdypart with its force.",
            "The temperature drops as usr1 creates a massive ice spike from the ground beneath usr2, impaling their bdypart directly.",
            "usr1 channels a torrential downpour, turning into a water cyclone around usr2, focusing destructively on their bdypart.",
            "usr1 conjures an ice dragon that breathes a freezing blast, encasing usr2 in ice, particularly freezing their bdypart.",
            "A sudden blizzard conjured by usr1 envelops usr2, with ice crystals targeting and accumulating on their bdypart.",
            "In a display of power, usr1 forms a giant water hammer, smashing it down on usr2 with a focus on crushing their bdypart.",
            "usr1 summons the fury of the storm, calling down a bolt of lightning to strike usr2, superheating the water around their bdypart.",
            "usr1's spell causes the ground to flood suddenly, with whirlpools forming specifically around usr2's bdypart.",
            "A wall of ice rises at usr1's command, then shatters explosively, sending sharp fragments particularly towards usr2's bdypart.",
            "usr1 unleashes a barrage of water bullets, each one homing in on usr2, with relentless hits to their bdypart."
        ],
        "overflow": [
            "As usr1's stored water magic overflows, it rejuvenates them but sends a shockwave of icy blasts towards usr2, chilling their bdypart.",
            "The excess magic bursts out as a cascade of healing water for usr1, while an unexpected wave crashes onto usr2, crushing on their bdypart.",
            "usr1's magic surges, releasing a restorative mist around them, but causing the ground under usr2 to become slippery and cold, particularly numbing their bdypart.",
            "Overflowing energy from usr1 turns into a sudden torrent that heals their wounds but soaks usr2, concentrating the cold on their bdypart.",
            "usr1's aura of water magic grows too strong, enveloping them in a protective bubble while sending a splashing wave that unexpectedly hits usr2's bdypart.",
            "When usr1's water magic peaks, it forms a revitalizing rain over them, while a miniature whirlpool forms around usr2, tugging at their bdypart.",
            "As usr1 is enveloped in a healing water column, the overflow sends a series of water spikes towards usr2, impaling their bdypart.",
            "The build-up of magical water around usr1 bursts forth as a healing fountain, while the spray catches usr2 off guard, dousing their bdypart.",
            "usr1's excess magic releases a burst of steam, providing them warmth and recovery, while scalding steam burns usr2, scalding their bdypart.",
            "Overflow from usr1 creates a soothing water shield around them, while the displaced water rushes towards usr2, swirling around their bdypart."
        ]
    },
    "terramancer": {
        "normal": [
            "usr1 summons a jagged rock from the ground that shoots towards usr2, striking their bdypart.",
            "With a stomp, usr1 causes the earth beneath usr2 to ripple, knocking them off their feet and hitting their bdypart.",
            "usr1 claps their hands together, and a wall of dirt rises abruptly in front of usr2, then collapses onto their bdypart.",
            "A sudden spire of stone erupts under usr2, catching them unawares and jabbing at their bdypart.",
            "usr1 gestures forcefully, and several small pebbles lift from the ground, swirling around usr2 and pelting their bdypart.",
            "The ground under usr2's feet becomes quicksand, pulling them down slightly, grasping at their bdypart.",
            "usr1 flicks their wrist, and a sharp slate shard flies straight, nicking usr2's bdypart.",
            "usr1's eyes glow with earthy power as they cause thorny vines to burst from the ground, wrapping around usr2's bdypart.",
            "With a powerful chant, usr1 summons a gust of sandy wind that blasts against usr2, scratching their bdypart.",
            "usr1 pounds the ground, and a shockwave of loose earth travels towards usr2, enveloping their bdypart."
        ],
        "crit": [
            "usr1 calls upon the strength of ancient mountains, causing a massive boulder to roll over usr2, focusing on their bdypart.",
            "A giant fissure opens in the earth at usr1's command, swallowing usr2 up to their neck before snapping shut on their bdypart.",
            "usr1 conjures an earthquake, the tremors knocking usr2 off balance and causing a nearby tree to fall towards their bdypart.",
            "With a thunderous roar, usr1 summons a wave of molten lava that flows rapidly towards usr2, engulfing their bdypart.",
            "usr1's command causes the metallic ores in the soil to explode upwards, forming sharp spikes that impale usr2's bdypart.",
            "The ground beneath usr2 erupts, sending a pillar of granite shooting up, smashing into their bdypart.",
            "usr1 harnesses the power of a subterranean river, which bursts forth, sweeping usr2 off their feet and drenching their bdypart.",
            "usr1 creates a vortex of gravel and rock, trapping usr2 inside and whirling abrasively against their bdypart.",
            "A sudden growth of crystalline structures surrounds usr2, closing in quickly and scratching their bdypart.",
            "usr1 unleashes a barrage of boulder-sized earth clods, each one targeting usr2 with devastating impact on their bdypart."
        ],
        "mega-crit": [
            "After collecting enough earthen shards, usr1 channels their power into a monumental earth dragon that rises and crashes down onto usr2, crushing their bdypart.",
            "The gathered shards empower usr1 to call forth a massive golem, which lumbers towards usr2 and delivers a crushing blow to their bdypart.",
            "With the shards vibrating with power, usr1 causes the entire landscape to shift, causing a cliffside to crumble onto usr2, burying their bdypart.",
            "Earthen shards swirl around usr1, forming a giant hammer of stone that they swing with force, smashing it down onto usr2's bdypart.",
            "The power of the collected shards allows usr1 to open a chasm beneath usr2, which then snaps shut, trapping their bdypart momentarily.",
            "usr1, fueled by the shards, summons a storm of razor-sharp rock fragments that converge on usr2, slicing across their bdypart.",
            "The shards integrate into the ground at usr1's command, causing explosive geysers of mud and stone to erupt under usr2, blasting their bdypart.",
            "Earthen energy peaks as usr1 commands the roots and soil to entangle usr2, tightening around their bdypart with crushing force.",
            "usr1 manipulates the collected shards to form a ring of fire-infused stones that encircle and then converge on usr2, focusing on their bdypart.",
            "Mega-critically charged, usr1 directs the earthen shards to morph into a barrage of stone spikes that launch at high speed towards usr2, impaling their bdypart."
        ]
    },
    "scholar": {
        "normal": [
            "usr1 opens an ancient tome filled with arcane symbols, their eyes widening as they uncover forgotten knowledge.",
            "In a quiet library, usr1 pores over dusty scrolls, piecing together lost histories and mysteries of the past.",
            "usr1 adjusts their glasses, examining a map of the stars. They jot down notes about celestial alignments and their effects.",
            "Surrounded by piles of books, usr1 delves deep into the study of alchemical recipes, discovering new combinations of herbs and minerals.",
            "usr1 sits at a cluttered desk, lamp light flickering as they decipher old manuscripts about legendary artifacts.",
            "In the hallowed silence of the archives, usr1 uncovers a parchment detailing the rituals of ancient mages, their mind racing with possibilities.",
            "usr1, surrounded by digital screens, analyzes data from archaeological digs, piecing together the history of a long-lost civilization.",
            "With a magnifying glass in hand, usr1 studies intricate carvings on an ancient artifact, each symbol revealing a piece of history.",
            "usr1, sipping on tea, reads through a heavy, leather-bound book about mythical creatures, fascinated by the detailed illustrations.",
            "usr1 attends a lecture by a renowned historian, eagerly absorbing every word and making extensive notes for later study."
        ],
        "crit": [
            "In a flash of insight, usr1 has an epiphany about the interconnectedness of magic and science, rewriting what is known about both fields.",
            "While studying ancient texts, usr1 suddenly understands a forgotten language, unlocking secrets hidden for millennia.",
            "usr1's study of astral charts leads to a breakthrough, predicting a celestial event that hasn't been observed in over a century.",
            "Amidst old architectural plans, usr1 discovers the blueprint for a legendary lost city, realizing it might still exist.",
            "During a late-night research session, usr1 pieces together clues that solve a historical mystery long thought unsolvable.",
            "While examining artifacts, usr1 deciphers a prophecy that foretells a looming conflict, giving them a chance to prevent it.",
            "usr1's ongoing research into elemental magic leads to a startling discovery about how these forces can be harmonized.",
            "An epiphany strikes usr1 as they correlate mythological tales with historical events, revealing truths about ancient heroes and villains.",
            "In an ancient medical text, usr1 finds a cure for a disease thought incurable, potentially saving thousands of lives.",
            "usr1's study of political treatises results in a theory about governance that could revolutionize the way societies are structured."
        ]
    },
    "warrior": {
        "normal": [
            "usr1 swings their large sword in a wide arc, slicing through the air and striking usr2's bdypart.",
            "With a powerful overhead chop, usr1 brings their sword down hard on usr2, impacting their bdypart with great force.",
            "usr1 lunges forward, thrusting their sword towards usr2, piercing right through their bdypart.",
            "A quick and precise slash from usr1's sword leaves a deep cut on usr2's bdypart.",
            "usr1 executes a series of rapid strikes, each blow targeting usr2's bdypart with increasing ferocity.",
            "In a fluid motion, usr1 parries an incoming attack and counters with a swift cut to usr2's bdypart.",
            "usr1 spins around, gaining momentum before their sword crashes into usr2's bdypart with a resounding thud.",
            "With a feint, usr1 deceives usr2 before delivering a crippling blow to their bdypart.",
            "usr1's sword glints in the sunlight as they perform a perfect slice, aiming it directly at usr2's bdypart.",
            "usr1 charges at usr2, sword raised, and with a powerful yell, slashes across usr2's bdypart, drawing a line of red."
        ],
        "crit": [
            "usr1 summons all their strength and delivers a devastating blow with their sword, nearly cleaving usr2 in half at their bdypart.",
            "With a mighty roar, usr1's sword swing becomes a deadly blur, striking usr2's bdypart with bone-crushing force.",
            "usr1 performs a legendary sword technique, slicing through the air with such speed and precision that usr2's bdypart is almost surgically severed.",
            "A critical strike from usr1 sends shockwaves through the battlefield, the sword's edge striking usr2's bdypart with thunderous impact.",
            "usr1's blade sings as it cuts a wide, devastating swath through usr2's bdypart, leaving nothing but destruction in its wake.",
            "In a display of unmatched skill, usr1 flips their sword and drives it down into usr2's bdypart, the ground cracking under the force.",
            "usr1 catches usr2 off guard with a sudden, ferocious attack that not only damages but also demoralizes, focusing on their bdypart.",
            "With precision born of years of training, usr1's critical strike not only wounds but also perfectly disarms usr2, targeting their bdypart.",
            "usr1's sword seems to glow with an inner fire as they unleash a powerful slash that burns as well as cuts usr2's bdypart.",
            "The air itself seems to split as usr1 delivers a strike so powerful, it creates a sonic boom as the sword meets usr2's bdypart."
        ]
    },
    "samurai": {
        "normal": [
            "usr1 draws their katana in a swift, fluid motion, slicing the air before making a precise cut on usr2's bdypart.",
            "With calm precision, usr1 steps forward and delivers a sharp, diagonal slash across usr2's bdypart.",
            "usr1 performs a quick parry followed by a counter-strike, targeting usr2's bdypart with the tip of their katana.",
            "In a display of skill, usr1 circles around usr2 and strikes a rapid blow to their bdypart, barely giving them time to react.",
            "usr1 executes a series of controlled, elegant strikes with their katana, each one aimed carefully at usr2's bdypart.",
            "With a low stance, usr1 lunges, thrusting their katana forward to pierce usr2's bdypart with deadly accuracy.",
            "usr1's katana glints ominously under the moonlight as they deliver a silent, slicing strike to usr2's bdypart.",
            "Moving like a shadow, usr1 closes the distance and unleashes a quick slash that grazes usr2's bdypart, leaving a clean cut.",
            "usr1 feints to the left, then quickly changes direction, bringing their katana down on usr2's bdypart in a powerful stroke.",
            "With a battle cry, usr1 charges, katana raised, and slashes horizontally, aiming a deep, sweeping cut at usr2's bdypart."
        ],
        "crit": [
            "usr1 channels the ancient spirit of the samurai, enhancing their strike with incredible force, cleaving through usr2's bdypart as if it were paper.",
            "With perfect form, usr1 executes a deadly iaijutsu technique, drawing and striking in one fluid motion that critically hits usr2's bdypart.",
            "usr1's katana arcs through the air with a whistling sound, delivering a cut so precise and deep that it could split usr2's bdypart in two.",
            "In a single moment of clarity and peak concentration, usr1's strike becomes a blur, impacting usr2's bdypart with both grace and devastation.",
            "The ground trembles slightly as usr1 unleashes a powerful, resonant strike that not only wounds but also immobilizes usr2 by targeting their bdypart.",
            "usr1's mastery over their blade shines as they perform a complex maneuver that ends with a critical thrust directly into usr2's bdypart.",
            "A sudden gust accompanies usr1's movement as they deliver a strike that is both beautiful and deadly, aimed perfectly at usr2's bdypart.",
            "With the precision of a master calligrapher, usr1's katana signs its deadly script across usr2's bdypart, the damage extensive and critical.",
            "usr1's katana seems to cut through the very fabric of reality, creating a shockwave as it critically strikes usr2's bdypart.",
            "As if guided by the spirits of past warriors, usr1's critical strike not only hits but also artistically carves through usr2's bdypart, leaving a tale of pain and awe."
        ]
    },
    "boxer": {
        "normal": [
            "usr1 throws a quick jab, landing a sharp punch on usr2's bdypart.",
            "With agility, usr1 dodges to the side and delivers a solid uppercut to usr2's bdypart.",
            "usr1 unleashes a flurry of rapid punches, each strike targeting usr2's bdypart with precision.",
            "A calculated hook from usr1 swings around, connecting heavily with usr2's bdypart.",
            "usr1 steps back, then lunges forward with a powerful straight punch that hits usr2's bdypart.",
            "In a defensive stance, usr1 counters usr2's move with a swift cross to their bdypart.",
            "usr1's footwork dazzles as they maneuver around usr2, landing a punch on their bdypart from an unexpected angle.",
            "With a burst of energy, usr1 throws a combination, finishing with a strong blow to usr2's bdypart.",
            "usr1 channels their focus, delivering a precise jab that snaps usr2's head back by striking their bdypart.",
            "Using the ropes, usr1 rebounds with added momentum to land a heavy punch on usr2's bdypart."
        ],
        "crit": [
            "usr1 measures usr2 carefully, then with a shout, delivers a devastating overhand that instantly knocks usr2 out, targeting their bdypart.",
            "With a fierce roar, usr1 executes a perfect spinning back fist, catching usr2 off-guard and knocking them out cold by hitting their bdypart.",
            "usr1 ducks under usr2's swing and counters with a knockout uppercut, lifting usr2 off their feet as it connects with their bdypart.",
            "In a display of raw power, usr1 lands a crushing body shot that folds usr2 over, effectively knocking them out with impact to their bdypart.",
            "usr1's timing is impeccable as they slip past usr2's defense and land a knockout hook to their bdypart, sending usr2 spinning.",
            "The crowd goes wild as usr1 feints left then lands a thunderous right straight, knocking usr2 out with a direct hit to their bdypart.",
            "usr1's combo culminates in a powerful haymaker that crashes into usr2's bdypart, rendering them unconscious instantly.",
            "In a critical moment, usr1 steps inside usr2's reach and delivers a lightning-fast knockout blow to their bdypart.",
            "usr1 catches usr2 as they stumble, finishing with a heavy knockout punch that snaps usr2's head back by impacting their bdypart.",
            "With clinical precision, usr1 finds an opening and exploits it with a swift, brutal strike to usr2's bdypart, achieving a clean knockout."
        ]
    },
    "criminal": {
        "normal": [
            "usr1 sneaks up behind usr2, delivering a quick, sharp blow to their bdypart.",
            "With cunning agility, usr1 lunges forward, stabbing a concealed weapon into usr2's bdypart.",
            "usr1 throws a handful of sand into usr2's eyes before striking their bdypart hard with a makeshift club.",
            "In a dark alley, usr1 ambushes usr2, landing several harsh punches to their bdypart.",
            "usr1 distracts usr2 with a feint, then quickly knees them in their bdypart.",
            "From the shadows, usr1 attacks, slashing usr2's bdypart with a razor-sharp blade.",
            "usr1 catches usr2 off-guard at a vulnerable moment, delivering a crushing blow to their bdypart.",
            "usr1 executes a swift and brutal takedown, slamming usr2 onto the ground and targeting their bdypart.",
            "In a ruthless display, usr1 uses brass knuckles to enhance a punch, severely impacting usr2's bdypart.",
            "usr1, blending into the crowd, suddenly strikes usr2 with a hidden weapon, hitting their bdypart unexpectedly."
        ],
        "crit": [
            "With a maniacal laugh, usr1 delivers a devastating strike with a lead pipe to usr2's bdypart, leaving them writhing in agony.",
            "usr1 expertly maneuvers into position and executes a bone-crushing strike to usr2's bdypart, knocking them out instantly.",
            "In a brutal flurry, usr1 overwhelms usr2 with rapid, precise strikes, each more vicious than the last, particularly focusing on their bdypart.",
            "usr1's cold efficiency shines as they incapacitate usr2 with a series of methodical, disabling blows to their bdypart.",
            "With ruthless precision, usr1 stabs a hidden dagger deep into usr2's bdypart, twisting it to ensure maximum damage.",
            "Using the environment to their advantage, usr1 smashes usr2 against a wall, followed by a crippling blow to their bdypart.",
            "usr1 reveals a shocking level of brutality as they break usr2's bdypart with a horrifying snap.",
            "The attack by usr1 is so swift and forceful that usr2 barely has time to scream before collapsing, their bdypart critically damaged.",
            "usr1 performs a perfect, lethal strike, slicing across usr2's bdypart with a bladed weapon, leaving a gory scene.",
            "In an explosive display of violence, usr1 uses a modified firearm at close range to blast usr2's bdypart, ensuring a critical injury."
        ],
        "crime": [
            "usr1 attempts to pickpocket a distracted bystander, smoothly lifting a wallet without notice.",
            "Under the cover of darkness, usr1 skillfully bypasses a security system to gain unauthorized entry.",
            "usr1 forges an official document with such expertise that it's indistinguishable from the real thing.",
            "Using charm and deceit, usr1 cons a wealthy mark out of a significant sum of money.",
            "usr1 hacks into a secure network, siphoning off data without leaving a trace.",
            "In a crowded market, usr1 stealthily cuts a purse from a belt, disappearing into the crowd with their loot.",
            "usr1 sells counterfeit goods to unsuspecting buyers, turning a tidy profit from the scam.",
            "With meticulous planning, usr1 orchestrates a smuggling operation across borders, avoiding all checkpoints.",
            "usr1 engages in a high-stakes game of illegal gambling, bluffing their way to a substantial win.",
            "During a chaotic event, usr1 manages to steal a valuable piece of artwork, expertly avoiding detection."
        ],
        "crime-crit": [
            "usr1's pickpocketing skills reach a pinnacle as they lift an exceptionally valuable item, outsmarting high security.",
            "During a complex heist, usr1 expertly cracks a state-of-the-art safe, extracting priceless jewels without a hitch.",
            "usr1's forgery of a top-level government document not only goes undetected but is used to sway international policies.",
            "usr1 cons an entire room of investors in a sophisticated scheme, walking away with millions.",
            "By exploiting a zero-day vulnerability, usr1 pulls off a massive data heist that cripples a major corporation.",
            "usr1 masterminds a grand theft auto, stealing a luxury sports car right from under the nose of security.",
            "The counterfeit goods usr1 distributes are mistaken for rare collectibles, fetching a fortune on the black market.",
            "usr1 orchestrates an elaborate art theft during a high-profile gala, smoothly escaping with a world-renowned masterpiece.",
            "In an audacious display of hacking prowess, usr1 manipulates financial markets, making a fortune overnight.",
            "usr1 executes a perfect identity theft, living lavishly under a billionaire's guise for months before anyone notices."
        ],
        "crime-fail": [
            "usr1 tries to pickpocket someone, but clumsily alerts them instead, leading to a chase.",
            "While attempting to bypass security, usr1 trips an alarm, causing a swift and embarrassing arrest.",
            "A forgery attempt by usr1 goes horribly wrong, resulting in easily detectable flaws that get them caught.",
            "usr1's con falls flat when their target turns out to be an undercover cop.",
            "A failed hacking attempt locks usr1 out of the system, leaving behind enough clues to lead directly to them.",
            "In a botched purse-snatching, usr1 tangles up in the crowd, allowing their target to easily retrieve their belongings.",
            "usr1's counterfeit goods are immediately recognized as fakes, leading to a quick detainment by authorities.",
            "A smuggling attempt by usr1 ends in disaster as the contraband is discovered at a checkpoint.",
            "usr1 loses a substantial amount of money in an illegal gamble when the game is raided by police.",
            "usr1's attempt to steal artwork ends with them accidentally setting off the gallery's elaborate security system."
        ]
    },
    "entertainer": {
        "normal": [
            "usr1 steps onto the stage, capturing the crowd's attention with a charming opening number.",
            "With a flourish of their costume, usr1 performs a captivating dance routine, earning applause from the audience.",
            "usr1 tells a series of witty jokes, keeping the crowd laughing and engaged throughout their set.",
            "Sitting at the piano, usr1 plays a beautiful melody, drawing appreciative nods and hums from the listeners.",
            "usr1 performs a dramatic monologue, their expressive voice filling the room and holding the audience spellbound.",
            "With a magic trick, usr1 pulls a rabbit out of a hat, eliciting gasps and cheers from the spectators.",
            "usr1 juggles several colorful balls in intricate patterns, keeping the audience's eyes glued to their skillful display.",
            "usr1 sings a heartfelt ballad, their voice echoing through the venue as the crowd listens in rapt silence.",
            "Using ventriloquism, usr1 brings a puppet to life, engaging the audience in a humorous dialogue that delights young and old alike.",
            "usr1 performs an acoustic guitar set, their fingers deftly strumming chords that resonate warmly with the audience."
        ],
        "crit": [
            "usr1 delivers a performance so moving that it brings the audience to tears, leaving a lasting impression of deep emotional resonance.",
            "With an explosive display of talent, usr1 executes a dance routine that ends in a standing ovation, inspiring young dancers in the crowd.",
            "usr1's comedic timing is impeccable, resulting in a performance that people talk about for days, spreading joy and laughter beyond the venue.",
            "Playing a complex classical piece, usr1 receives a thunderous applause, their music inspiring some audience members to pursue their own musical passions.",
            "usr1's dramatic interpretation of a historical figure is so powerful it inspires a local theater group to adopt the play into their repertoire.",
            "During a magic show, usr1 performs an illusion so unbelievable that it becomes the highlight of the evening, inspiring awe and wonder.",
            "usr1 juggles flaming torches with such skill and flair that it ignites a passion for the circus arts among the spectators.",
            "usr1's vocal performance is so stunning that it is recorded and shared widely, becoming a viral sensation that inspires aspiring singers.",
            "usr1's ventriloquist act is so innovative that it revives interest in the art form, leading to invitations to perform internationally.",
            "usr1's guitar solo is so masterful and inspiring that it prompts a local community center to start offering guitar lessons."
        ]
    },
    "nomad": {
        "normal": [
            "usr1 brandishes their scimitar, swiftly striking usr2's bdypart with a clean, slicing motion.",
            "With agile movements, usr1 dashes towards usr2 and delivers a quick slash across their bdypart.",
            "usr1 twirls their scimitar with expert precision before chopping down on usr2's bdypart.",
            "In a fluid sequence, usr1 parries an incoming blow and counters with a sharp cut to usr2's bdypart.",
            "usr1 leaps from a higher ground, descending with their scimitar aimed straight at usr2's bdypart.",
            "With a deceptive feint, usr1 draws usr2 in, then swiftly cuts across their bdypart.",
            "usr1's scimitar glints under the sun as they execute a series of rapid strikes, each targeting usr2's bdypart.",
            "usr1 charges forward, using the momentum to enhance a powerful slash at usr2's bdypart.",
            "In a display of dexterity, usr1 spins around and delivers a backhanded slice to usr2's bdypart.",
            "usr1 ducks under usr2's attack and responds with a rising slash, targeting their bdypart."
        ],
        "crit": [
            "With a battle cry, usr1 channels their inner strength and delivers a devastating blow with their scimitar, cleaving usr2's bdypart dramatically.",
            "usr1's scimitar strikes with such force that it causes a shockwave, critically impacting usr2's bdypart and sending them flying backward.",
            "In a masterful display of swordsmanship, usr1 performs a deadly dance, ending with a critical strike to usr2's bdypart that leaves them incapacitated.",
            "usr1 predicts usr2's movement and intercepts them with a powerful thrust of their scimitar, critically piercing usr2's bdypart.",
            "As the dust settles, usr1 emerges with a silent slash that critically wounds usr2's bdypart, the precision of the strike evident.",
            "With the speed of the desert wind, usr1's scimitar slices through the air, landing a critical, slicing blow on usr2's bdypart.",
            "usr1's scimitar arcs beautifully yet deadly across the battlefield, delivering a blow that critically bisects usr2's bdypart.",
            "Under the moonlight, usr1's scimitar seems to glow as they deliver a swift, critical strike that cleanly severs usr2's bdypart.",
            "In a blink of an eye, usr1 closes the distance and unleashes a fury of slashes, the final one critically striking usr2's bdypart with lethal precision.",
            "With a roar of determination, usr1 swings their scimitar downward in a mighty arc, critically smashing through usr2's defense and striking their bdypart."
        ]
    } ,
    "hunter": {
        "normal": [
            "usr1 takes careful aim and fires an arrow, striking usr2's bdypart with precision.",
            "With a steady hand, usr1 releases an arrow that whistles through the air, hitting usr2's bdypart.",
            "usr1 camouflages into the surroundings, then shoots an arrow that silently pierces usr2's bdypart.",
            "From a hidden vantage point, usr1 launches an arrow that arcs beautifully before striking usr2's bdypart.",
            "usr1 draws their bow with a swift motion, sending an arrow flying straight into usr2's bdypart.",
            "In the blink of an eye, usr1 fires two quick arrows, both targeting usr2's bdypart.",
            "usr1 uses the wind to their advantage, guiding an arrow to land a distant shot on usr2's bdypart.",
            "With unmatched focus, usr1 fires an arrow that splits a previous one, continuing to usr2's bdypart.",
            "usr1 performs a rolling maneuver and shoots, hitting usr2's bdypart from an unexpected angle.",
            "Under moonlight, usr1's arrow finds its mark, embedding deeply into usr2's bdypart.",
            "usr1 ascends a tree swiftly, then shoots an arrow downward, striking usr2's bdypart effectively.",
            "With a rapid sidestep, usr1 dodges an attack and retaliates with an arrow to usr2's bdypart.",
            "From across the field, usr1's arrow soars, hitting usr2's bdypart with deadly accuracy.",
            "usr1 kneels for stability, takes aim, and fires an arrow that zips directly to usr2's bdypart.",
            "As rain falls, usr1's concentration doesn't waver; their arrow pierces through the downpour into usr2's bdypart."
        ],
        "crit": [
            "usr1's critical shot glows faintly, marking usr2 after striking their bdypart with a specially crafted arrow.",
            "In a moment of perfect clarity, usr1 releases an arrow that not only hits usr2's bdypart but also leaves a luminous trail, marking them.",
            "usr1 whispers an ancient hunter's chant, enhancing their arrow which critically hits and marks usr2's bdypart for follow-up attacks.",
            "With a piercing whistle, usr1's arrow embeds deeply in usr2's bdypart, leaving a glowing mark that signals vulnerability.",
            "usr1 shoots an arrow that splits the air with a sharp twang, marking usr2's bdypart critically, readying them for the kill.",
            "As thunder roars, usr1's arrow strikes usr2's bdypart with such force it leaves a mark glowing with energy.",
            "usr1 fires a barbed arrow, hitting usr2's bdypart critically and marking them with an aura that draws attention.",
            "With the precision of a master archer, usr1's critical hit not only damages but also paints usr2's bdypart with a target mark.",
            "usr1 launches a critical shot infused with magic, marking usr2's bdypart while dealing significant damage.",
            "A critical hit from usr1’s arrow leaves a pulsating mark on usr2’s bdypart, a beacon for subsequent attacks.",
            "usr1’s arrow, carved with runes, flies true and marks usr2’s bdypart with a mystical sigil upon striking critically.",
            "In a display of legendary skill, usr1’s critical shot leaves a trail of light leading to the marked bdypart of usr2.",
            "The arrow released by usr1 embeds into usr2’s bdypart, leaving behind a luminescent mark that foretells further peril.",
            "usr1's arrow unleashes a burst of light upon impact, marking usr2’s bdypart and setting the stage for a devastating follow-up.",
            "With a flare visible across the battlefield, usr1’s critical strike marks usr2’s bdypart, highlighting them for all to target."
        ]
    },
    "tamer": {
        "normal": [
            "usr1 nocks an arrow, draws back their bow, and releases, the arrow whistling through the air to strike usr2's bdypart.",
            "With a calm presence, usr1 uses their bow to fire a shot that arcs gracefully before hitting usr2's bdypart.",
            "usr1 steps lightly through the underbrush, firing a quick arrow that nicks usr2's bdypart as they command a rabbit to distract.",
            "From the treetops, usr1 sends an arrow soaring downward, striking usr2's bdypart, while a squirrel scurries around their feet.",
            "usr1 kneels, takes careful aim with their bow, and lets loose an arrow that flies true to usr2's bdypart as a fox watches silently.",
            "In a fluid motion, usr1 launches two arrows in quick succession; one grazes usr2's bdypart, the other distracts as a bird swoops down.",
            "usr1 blends into their surroundings, then suddenly appears to loose an arrow at usr2's bdypart, while a deer nudges them from behind.",
            "With the sun behind them, usr1 shoots an arrow that glints brightly before impacting usr2's bdypart, as a raccoon steals usr2's attention.",
            "usr1, perched upon a high rock, draws their bow and targets usr2's bdypart, while a snake slithers quietly towards usr2.",
            "A whisper from usr1 sends a dove flying overhead as a distraction while they aim and fire an arrow at usr2's bdypart.",
            "usr1 hums a tune that calms the woods, firing an arrow that zips through the trees to hit usr2's bdypart as a bear growls nearby.",
            "Silently, usr1 commands a small pack of wolves to circle around as they shoot an arrow towards usr2's bdypart.",
            "With precision, usr1 fires their bow from behind cover, the arrow striking usr2's bdypart as a skunk readies its spray.",
            "usr1's arrow slices through a gust of wind, hitting usr2's bdypart, while a bobcat pounces near usr2 to startle.",
            "Amidst falling leaves, usr1 looses an arrow that spirals before hitting usr2's bdypart, accompanied by the chatter of monkeys."
        ],
        "crit": [
            "At usr1's silent command, a majestic eagle dives from the sky, talons outstretched, striking a critical blow to usr2's bdypart.",
            "With a flick of usr1's wrist, a formidable wolf pack launches a synchronized attack, critically mauling usr2's bdypart.",
            "usr1 signals subtly; a bear charges out, delivering a powerful swipe that critically impacts usr2's bdypart with brutal force.",
            "Under usr1's guidance, a stealthy panther leaps from the shadows, delivering a critical strike with its sharp claws to usr2's bdypart.",
            "A sharp whistle from usr1 cues a giant stag to charge, its antlers goring usr2's bdypart critically, pinning them momentarily.",
            "usr1's connection with the wild calls forth a swarm of bees, which envelop usr2, stinging their bdypart critically with coordinated precision.",
            "At usr1’s nod, a boar with razor-sharp tusks charges through the underbrush, goring usr2’s bdypart critically, leaving them staggered.",
            "usr1 raises an arm, signaling a hawk to swoop down in a deadly dive, its beak striking a critical hit on usr2's bdypart.",
            "The ground rumbles on usr1's command as a massive rhino charges at usr2, critically striking their bdypart with its horn.",
            "usr1's silent gesture summons a serpent that delivers a sudden, venomous bite to usr2's bdypart, critically weakening them.",
            "With a calm whisper, usr1 directs a lynx that pounces from a high ledge, landing a critical blow on usr2’s bdypart with its claws.",
            "usr1 makes a subtle hand signal, and an otter swiftly approaches usr2, delivering a surprisingly critical bite to their bdypart.",
            "A coyote, called by usr1, stealthily approaches and delivers a critical bite to usr2's bdypart, then vanishes back into the brush.",
            "usr1 orchestrates a critical assault as a porcupine launches quills with pinpoint accuracy at usr2's bdypart, each quill hitting with unexpected force.",
            "On usr1's command, a group of mountain goats charge down the slope, ramming into usr2 with focused aggression, critically striking their bdypart."
            ]
        },
    "gunner": {
        "normal": [
            "usr1 quickly draws their pistol and fires a shot, grazing usr2's bdypart.",
            "With a steady aim, usr1 squeezes the trigger, sending a bullet whizzing close to usr2's bdypart.",
            "usr1 ducks behind cover, then pops out to fire a rapid burst towards usr2, hitting their bdypart.",
            "In a fluid motion, usr1 reloads and fires a precise shot at usr2's bdypart from across the room.",
            "usr1, with a flick of their wrist, spins the gun before firing, the bullet striking usr2's bdypart.",
            "Using the shadows to their advantage, usr1 takes a stealthy shot at usr2, the bullet silently hitting their bdypart.",
            "usr1's hand steadies, their focus sharp; they take a breath and fire, the bullet piercing usr2's bdypart.",
            "From a kneeling position, usr1 aims and shoots, effectively hitting usr2's bdypart with a well-placed bullet.",
            "usr1 maneuvers through the chaos, finds a clear line, and fires, the bullet impacting usr2's bdypart.",
            "usr1 takes a quick sidestep, dodges an incoming attack, and returns fire, hitting usr2's bdypart.",
            "In a daring move, usr1 slides across the floor, shooting as they go, striking usr2's bdypart.",
            "usr1, from a high vantage point, takes careful aim and fires, the bullet traveling downwards into usr2's bdypart.",
            "Amidst a spray of bullets, usr1 manages to focus and land a precise hit on usr2's bdypart.",
            "usr1 leans out from an alleyway, quickly fires two shots, both aimed at usr2's bdypart.",
            "As the smoke clears, usr1 identifies their target and fires, successfully hitting usr2's bdypart."
        ],
        "crit": [
            "In a moment of deadly precision, usr1 executes a perfect headshot, instantly neutralizing the threat posed by usr2.",
            "With ice-cold focus, usr1 lines up their sights and delivers a clean, swift headshot that drops usr2 in their tracks.",
            "usr1 adjusts their aim slightly, pauses, and then unleashes a shot. The bullet screams across the space, landing a critical headshot that silences usr2.",
            "The echo of the gunshot is sharp, and so is the impact; usr1's bullet drills into usr2's head, a textbook execution.",
            "As usr2 moves to take cover, usr1 tracks, fires, and scores a headshot, the bullet striking with lethal efficiency.",
            "usr1's tactical training shines as they squeeze the trigger, delivering a precise, devastating headshot to usr2.",
            "The air splits with the sound of usr1's gunshot, a critical strike as the bullet pierces usr2's head, dropping them instantly.",
            "Under the dim light, usr1’s aim proves deadly. They fire, and the bullet finds its mark, a devastating headshot that stops usr2 cold.",
            "In a split second of clarity and opportunity, usr1's bullet zooms straight to its target, achieving a critical headshot that stuns all who witness.",
            "usr1 whispers a challenge, fires, and the bullet arcs beautifully, culminating in a critical headshot that incapacitates usr2.",
            "With no hesitation, usr1 fires a headshot that is both sudden and devastating, dropping usr2 where they stand.",
            "The sound of the shot barely precedes the fall of usr2, taken down by a critical headshot from usr1's steady hand.",
            "usr1 takes a calculated risk, fires under pressure, and achieves a headshot, the bullet smashing into usr2's head with fatal precision.",
            "A quick peek, a quicker shot; usr1’s bullet flies true, resulting in a critical headshot that leaves usr2 motionless.",
            "usr1's precision is unmatched; with a single pull of the trigger, they deliver a headshot that critically impacts usr2, ending the confrontation."
        ]
    },
    "flameborn": {
        "normal": [
            "usr1 clenches their fist, and flames burst forth, engulfing usr2's bdypart in a sudden blaze.",
            "With a wave of their hand, usr1 sends a whip-like flame lashing across the air, scorching usr2's bdypart.",
            "usr1 stomps on the ground, causing a trail of fire to race towards usr2, wrapping around their bdypart.",
            "The air around usr1 heats up intensely as they project a searing blast of fire towards usr2's bdypart.",
            "usr1 draws a fiery circle in the air with their fingers, casting a ring of fire that encircles and burns usr2's bdypart.",
            "With a quick spin, usr1 releases a swirling vortex of flames that spirals toward usr2, focusing on their bdypart.",
            "usr1 snaps their fingers, and small sparks fly out, quickly igniting into a large flame that engulfs usr2's bdypart.",
            "usr1 channels their inner heat and exhales a stream of blue fire, directly targeting usr2's bdypart.",
            "Flames flicker around usr1's eyes as they concentrate, sending a focused beam of fire slicing through the air to usr2's bdypart.",
            "usr1 claps their hands together, then pulls them apart to reveal a ball of fire, which they hurl at usr2's bdypart.",
            "With an upward flick of their wrist, usr1 summons a pillar of flame from the ground beneath usr2, scorching their bdypart.",
            "usr1 gestures towards the sky, causing small meteors of burning rock to fall around usr2, one striking their bdypart.",
            "usr1's heartbeat intensifies, and with each beat, a pulse of fire emanates outward, singeing usr2's bdypart.",
            "usr1 reaches out their hand, and a tether of flame shoots forth, wrapping around and burning usr2's bdypart.",
            "With a roar, usr1 unleashes a wave of fire that sweeps across the battlefield, catching usr2's bdypart in its fiery grasp."
        ],
        "crit": [
            "usr1's body glows with an intense light as they channel the core of their fiery essence, releasing a devastating explosion of flames that completely incinerates usr2's bdypart.",
            "The ground cracks under usr1's feet as they summon a massive firestorm, the central column of fire striking usr2's bdypart with catastrophic heat.",
            "usr1's eyes blaze with a supernatural flame as they direct a dragon-shaped torrent of fire towards usr2, critically burning their bdypart with legendary force.",
            "With a thunderous chant, usr1 calls upon the ancient spirits of fire, summoning a fiery phoenix that dives and explodes on usr2's bdypart, leaving only ashes.",
            "usr1 draws the heat from the surroundings, concentrating it into a single, overwhelming inferno that blasts usr2's bdypart, leaving a charred mark.",
            "As usr1 chants in an ancient tongue, the air ignites into a swirling inferno, concentrating its fury on usr2's bdypart.",
            "With a dramatic flourish, usr1 summons a column of fire from beneath the earth, engulfing usr2's bdypart in flames that rise skyward.",
            "usr1's command causes the flames to leap higher, forming a fiery lion that pounces on usr2's bdypart, leaving searing wounds.",
            "A vortex of fire forms around usr1's outstretched hands, then rushes forward in a fiery wave that crashes over usr2's bdypart.",
            "usr1 harnesses the power of a volcanic eruption, sending a lava-like stream of fire to consume usr2's bdypart."
        ],
        "overheat": [
            "As the flames around usr1 reach an uncontrollable intensity, they erupt in a fiery explosion, causing additional damage around usr2's bdypart.",
            "usr1's internal heat becomes too much to contain, releasing a burst of flames that scorch the ground and intensify the damage to usr2's bdypart.",
            "Overheating after their critical attack, usr1 unleashes a shockwave of fire that spreads rapidly, catching everything near usr2 aflame.",
            "The overheat from usr1's flames causes nearby objects to ignite spontaneously, creating a dangerous, fiery environment around usr2.",
            "In the aftermath of their critical strike, usr1's excess energy manifests as a series of small explosions, each one adding burns to usr2's surroundings.",
            "The air crackles with heat as usr1's body radiates an intense warmth, sending waves of fire radiating outward, catching usr2's bdypart in a secondary blaze.",
            "usr1's control slips as their flames surge uncontrollably, resulting in a fiery burst that lashes out wildly, striking usr2 and the area around them.",
            "As usr1 focuses their power, the excess flames coil like serpents, striking out at usr2's bdypart with unexpected ferocity.",
            "The ground beneath usr1 glows red-hot, and sudden geysers of flame burst forth, adding a searing touch to the damage dealt to usr2's bdypart.",
            "usr1's flames gather into a fiery orb that explodes in a radius, sending burning embers flying, which rain down around usr2, causing additional burns."
        ]
    },
    "ashen sage": {
        "normal": [
            "usr1 gestures subtly, and a swirl of cinders sweeps towards usr2, lightly dusting their bdypart with hot ash.",
            "With a flick of their wrist, usr1 conjures a cloud of ash that envelopes usr2's bdypart, obscuring their vision and scorching their skin.",
            "usr1 stamps the ground, causing a burst of ash to rise and drift like a wave towards usr2, settling on their bdypart with a sizzle.",
            "The air around usr1 thickens with ash as they direct a dense column towards usr2, coating their bdypart in a layer of fine, hot dust.",
            "usr1 claps their hands, and a ring of smoldering ash erupts outward, circling usr2 and singeing their bdypart.",
            "With a sweeping motion, usr1 sends a carpet of cinders slithering across the ground, engulfing usr2's bdypart in burning debris.",
            "usr1 raises a hand, and from it, a spiral of fine ash spins out, wrapping around usr2's bdypart and leaving a trace of burns.",
            "The ground beneath usr2's feet becomes a bed of hot coals as usr1 manipulates the earth, heating up their bdypart uncomfortably.",
            "usr1's eyes glow with a fiery intensity, and they exhale a breath of scorching ash that blankets usr2's bdypart.",
            "A subtle twist of usr1's fingers causes ash to erupt from small fissures in the ground, targeting usr2's bdypart with precision.",
            "With a roar, usr1 summons an ash storm that obscures vision and burns all it touches, focusing on usr2's bdypart.",
            "usr1 whispers an incantation, causing ash to form into sharp, cutting whirlwinds that slice at usr2's bdypart.",
            "The ashes around usr1 animate into fiery serpents that lash out at usr2, biting and burning their bdypart.",
            "usr1 performs a dance of flames and ash, directing the performance towards usr2, engulfing their bdypart in fiery debris.",
            "usr1 casts a spell that causes the ashes beneath usr2 to ignite suddenly, blazing intensely around their bdypart."
        ],
        "crit": [
            "usr1 chants in an ancient tongue, and the ashes around them swirl violently before being hurled at usr2's bdypart with devastating force.",
            "With a commanding shout, usr1 causes the ashes beneath usr2's feet to explode upwards, enveloping them in a cloud of superheated cinders that sear their bdypart critically.",
            "usr1's mastery of ash culminates in a massive vortex that captures usr2 within, their bdypart bombarded by a relentless storm of cinders.",
            "In a dramatic display of power, usr1 summons a phoenix made entirely of ashes, which dives at usr2 and explodes on contact with their bdypart, leaving a mark of charred flesh.",
            "usr1 performs a complex ritual dance, and the result is a rain of fiery ash that descends upon usr2, focusing intensely on their bdypart and leaving it scorched.",
            "A thunderous command from usr1 ignites the air itself, turning the ash into a wave of flame that crashes over usr2, targeting their bdypart.",
            "usr1's fingertips glow, casting shadows as they flick them towards usr2, directing a sharp lance of ash that pierces their bdypart critically.",
            "With an eerie calm, usr1 conjures a swirling ash dragon that encircles and then savagely attacks usr2, focusing its fiery breath on their bdypart.",
            "usr1's words turn to a tangible curse, causing ash to harden and shoot towards usr2 like bullets, critically hitting their bdypart.",
            "usr1 raises their arms, and a tempest of ash and fire envelops usr2, the intensity of the heat critically burning their bdypart."
        ],
        "overheat": [
            "As usr1 reaches the peak of their power, the surrounding ashes respond, swirling towards them and being absorbed into their form, enhancing them.",
            "The overheat causes the ash in the air to become magnetically attracted to usr1, who absorbs it, their skin taking on a glowing, ember-like quality.",
            "Excess energy from usr1's critical attack causes nearby ashes to coalesce and rush towards them, granting them a temporary shield of swirling cinders.",
            "The ground's cinders move towards usr1 as if alive, wrapping around them and boosting their fiery energy, soothing them.",
            "Following a powerful spell, usr1's body acts as a beacon, drawing in all nearby ash and cinders, which cloak them in a shimmering aura of heat and light.",
            "Overheating intensifies around usr1, causing the ambient temperature to spike as they absorb the fiery essence of the ash, fueling their next magical onslaught.",
            "The air crackles with fiery energy as usr1 becomes the epicenter of a thermal vortex, pulling in ash and enhancing their mystical powers.",
            "usr1's command of the cinders reaches a climax as they draw in a whirlwind of ash, which fuses into their very being, augmenting their control over fire.",
            "As usr1 channels their overheat, the ground beneath them glows red-hot, with ash rising and seeping into their pores, strengthening their fiery attacks.",
            "The fiery aura around usr1 pulsates with power as they absorb the floating ashes, each particle enhancing their magic with explosive potential.",
            "usr1's presence causes the ashes from recent fires to lift from the ground, swirling around them and imbuing them with a protective mantle of flame.",
            "In the aftermath of their critical strike, usr1's hands draw in the scattered cinders, weaving them into a fabric of flame that coats their body.",
            "The ashen aftermath of usr1's spells begins to orbit them, each speck of cinder adding to their reservoir of fiery energy, ready for release.",
            "Heat shimmers in the air as usr1's overheat draws the ashes of the fallen back to life, circling them as if honoring a pyromancer of old.",
            "As usr1 absorbs the lingering ash, their eyes ignite with an inner fire, signaling a peak in their mystical prowess and readiness for further combat."
        ]
    },
    "pyrokinetic": {
        "normal": [
            "usr1 gestures, and a thin stream of flames targets usr2's bdypart, leaving a trail of scorched earth.",
            "With a flick of the wrist, usr1 conjures a swirling fireball that homes in on usr2, exploding on contact with their bdypart.",
            "usr1 draws a fiery sigil in the air; moments later, a burst of flame erupts beneath usr2, scorching their bdypart.",
            "The ground around usr1 cracks, emitting a jet of flame that snakes towards usr2, wrapping around their bdypart.",
            "usr1 claps their hands, and a shockwave of heat ripples through the air, singeing usr2's bdypart.",
            "With precise control, usr1 directs a series of small flames to dance around usr2, each one nipping at their bdypart.",
            "usr1 spins, gathering flames into a vortex that rushes towards usr2, engulfing their bdypart in a fiery tornado.",
            "A subtle nod from usr1 and the nearby campfire leaps towards usr2, forming a fiery whip that lashes their bdypart.",
            "usr1 raises their hand, causing the flames from torches to leap and form a fiery cage around usr2, concentrating heat on their bdypart.",
            "usr1 exhales deeply, a stream of blue flame shoots from their mouth, directly targeting and burning usr2's bdypart."
        ],
        "crit": [
            "usr1 summons a colossal wave of fire from the ground, sending it crashing over usr2, engulfing their bdypart in an infernal blaze.",
            "Chanting an arcane spell, usr1 causes the flames to intensify around usr2, suddenly exploding with force focused on their bdypart.",
            "usr1's eyes glow a fierce orange as they invoke a meteor shower of molten rock that rains down, targeting usr2's bdypart with devastating impacts.",
            "With a dramatic stomp, usr1 splits the earth, from which a giant pillar of fire shoots up directly under usr2, blasting their bdypart.",
            "usr1 conjures a dragon made of pure fire that swoops down from the sky, enveloping usr2 in flames focused on their bdypart.",
            "The air crackles as usr1 unleashes a sonic boom of heat, the shockwave hitting usr2 with enough intensity to char their bdypart.",
            "usr1 sketches an ancient rune in the air; it ignites into a blazing sun that hovers over usr2, radiating extreme heat onto their bdypart.",
            "In a display of raw power, usr1 creates a ring of fire that tightens around usr2, compressing with intense heat on their bdypart.",
            "usr1 points at usr2, and a bolt of fire zips from their fingertip, zigzagging through the air before striking usr2's bdypart with lethal precision.",
            "With a flourish, usr1 fans the air, manipulating the ambient heat to form a scorching wind that sears usr2's bdypart."
        ],
        "overheat": [
            "Overheating, usr1's body emits a radiant heat, causing nearby flammable materials to spontaneously ignite, enhancing their fiery aura.",
            "The ground beneath usr1 becomes molten, their overheat causing flames to burst forth randomly, hitting near usr2 with increased ferocity.",
            "usr1's overheat condition unleashes a protective flame barrier around them, burning anyone who comes too close, including targeted strikes at usr2's bdypart.",
            "As usr1 channels too much heat, they release a pulse of energy that sets the surrounding air ablaze, increasing the effectiveness of their next attack.",
            "The intense heat accumulating within usr1 causes their next spell to double in size, sending a massive firestorm towards usr2's bdypart.",
            "Unable to contain the power, usr1's overheat results in explosive fireballs that scatter around, each seeking usr2's bdypart.",
            "The overheat enhances usr1's control over fire, allowing them to direct multiple streams of flame simultaneously at usr2's bdypart.",
            "usr1's excess heat turns into a blinding flash of light that temporarily disorients usr2 while causing continuous fire damage.",
            "During overheat, usr1 generates a fiery shockwave that radiates outwards, dealing damage over a wide area, focusing especially on usr2's bdypart.",
            "The build-up of heat allows usr1 to momentarily summon a phoenix from the ashes, which performs a fiery dive attack on usr2's bdypart."
        ]
    },
    "toxinmancer": {
        "normal": [
            "usr1 flicks their wrist, sending a spray of toxic mist towards usr2, lightly coating their bdypart with venom.",
            "With a whispered incantation, usr1 conjures a cloud of noxious gas that envelops usr2, irritating their bdypart.",
            "usr1 throws a concocted vial at the ground near usr2; it shatters, releasing a creeping fog of toxin that grazes their bdypart.",
            "The air around usr1 shimmers with a sickly green hue as they direct a stream of poison towards usr2, making contact with their bdypart.",
            "usr1 plants a toxic trap on the ground; as usr2 approaches, it activates, puffing out a cloud of poison at their bdypart.",
            "With a snap of their fingers, usr1 causes thorny vines to burst from the ground, each thorn dripping with toxin, nicking usr2's bdypart.",
            "usr1 draws a circle in the dirt, and as usr2 crosses it, a burst of spores erupts, targeting their bdypart with hallucinogenic particles.",
            "The ground beneath usr2's feet becomes slick with a poisonous slime as usr1 manipulates the earth, causing minor burns to their bdypart.",
            "usr1's eyes flash a toxic green as they exhale a breath of venomous air, subtly poisoning usr2's bdypart.",
            "A gesture from usr1 summons a swarm of insects from nearby, each carrying a potent toxin that bites at usr2's bdypart."
        ],
        "crit": [
            "usr1 chants darkly, enhancing the toxicity of their spell; a massive wave of venom crashes over usr2, severely poisoning their bdypart and debilitating them.",
            "With a forceful clap, usr1 merges clouds of poison into a dense, dripping fog that descends on usr2, badly poisoning their bdypart and slowing their movements dramatically.",
            "usr1's mastery over toxins culminates in a targeted blast of corrosive acid, which eats away at usr2's bdypart, causing intense pain and lasting injury.",
            "A sinister laugh escapes usr1 as they direct a concentrated beam of toxin towards usr2, which penetrates deep into their system, causing severe internal poisoning.",
            "usr1 conjures a spectral serpent made of poison that lashes out at usr2, biting their bdypart with a venom that spreads crippling pain and weakness.",
            "In a display of toxic prowess, usr1 causes the plants around usr2 to exude a deadly poison, which leeches into their bdypart, causing severe nausea and disorientation.",
            "usr1 spins, gathering a whirlwind of toxic spores around them; the whirlwind envelops usr2, badly poisoning their bdypart and reducing their stamina.",
            "usr1 raises their hand, from which a dark ooze flows forth, forming tendrils that wrap around usr2, infusing their bdypart with a debilitating toxin.",
            "With precise control, usr1 sends several quick darts of poison flying towards usr2, each hitting their bdypart and causing acute poisoning that weakens them significantly.",
            "usr1 performs a ritual dance, calling forth rain from above; however, the droplets are toxic, soaking usr2 and badly poisoning their bdypart, causing fever and delirium."
        ]
    },
    "soulcrusher": {
        "normal": [
            "usr1 casts a shadowy tendril that wraps around usr2, lightly sapping energy from their bdypart.",
            "With a chilling chant, usr1 summons a ghostly hand that clutches at usr2, leaving their bdypart feeling numb.",
            "usr1 flicks their hand, sending a burst of dark energy towards usr2, which grazes their bdypart with a cold, weakening touch.",
            "The ground beneath usr2 darkens as usr1 directs a soul-sapping mist to rise and swirl around their bdypart, draining their energy.",
            "usr1's eyes glow with a dark power as they project a spectral beam that momentarily touches usr2's bdypart, inducing fear.",
            "With a sinister whisper, usr1 causes ethereal chains to bind usr2 momentarily, tugging at the essence of their bdypart.",
            "usr1 draws a sigil in the air that glows ominously before sending a wave of despair towards usr2, slightly darkening their bdypart.",
            "The air around usr2 chills as usr1 directs a cold breeze that steals warmth from their bdypart, leaving it pale and drained.",
            "usr1 mutters an incantation, causing the shadows to move towards usr2, lightly clawing at their bdypart with a spectral touch.",
            "With a subtle gesture, usr1 sends a pulse of dark energy that causes usr2's bdypart to tremble, weakened by an unseen force."
        ],
        "crit": [
            "usr1 raises their arms, and a vortex of soul-stealing winds envelops usr2, directly pulling at the essence of their bdypart, stealing their soul piece by piece.",
            "With a powerful roar, usr1 summons a storm of dark spirits that swarm around usr2, each spirit latching onto their bdypart and stealing fragments of their soul.",
            "usr1 channels a deep darkness, focusing it into a beam that strikes usr2's bdypart, piercing through and locking onto their soul to slowly drain it away.",
            "In an eerie silence, usr1's eyes darken as they extend a hand, drawing the soul from usr2's bdypart, leaving it visibly dimmer and hollow.",
            "usr1 performs a dark ritual, causing the ground beneath usr2 to crack, from which a hand of despair grips their bdypart, pulling at their soul aggressively.",
            "usr1 conjures a spectral hand that reaches deep into usr2, clutching their soul and extracting it painfully from their bdypart.",
            "With a sinister laugh, usr1 manipulates the shadows around usr2, each one binding to their bdypart and siphoning off pieces of their soul.",
            "usr1 whispers an ancient curse, causing dark energy to wrap around usr2's bdypart, extracting their soul with unbearable agony.",
            "usr1's gaze pierces through usr2, and a dark thread of power connects them, slowly drawing the soul out of usr2's bdypart.",
            "A dark cloud forms above usr2 as usr1 channels their power, from which tendrils descend, wrapping around usr2 and stealing their soul shard by shard."
        ],
        "soulcrush": [
            "With usr2's soul fragments in their grasp, usr1 crushes them mercilessly, causing an explosion of dark energy that devastates usr2's essence.",
            "usr1 closes their hand tightly over the stolen soul pieces, and as they crush them, usr2 feels an intense, soul-deep pain radiating from their bdypart.",
            "The soul fragments are compressed by usr1 into a dark crystal, which shatters violently, sending shards of agonizing energy through usr2's soul.",
            "usr1 performs a dark chant, and as they finalize the spell, usr2's soul fragments are obliterated, causing unbearable despair in usr2.",
            "usr1 tosses the captured soul fragments into the air, then smashes them with a wave of dark power, causing shockwaves of pain to echo through usr2's being.",
            "With a cold smile, usr1 grinds the soul fragments into dust between their palms, and usr2 experiences a loss of vitality as their essence is diminished.",
            "usr1 absorbs the soul fragments into their own being and then expels them as a burst of dark energy, annihilating the remnants of usr2's soul.",
            "The soul fragments are bound into a dark orb by usr1, which they then crush underfoot, causing usr2 to stagger under the weight of their crushed soul.",
            "usr1 channels the soul fragments into a vortex of dark energy, compressing them until they implode, sending a shock of soul-crushing agony through usr2.",
            "usr1 casts the soul fragments into a dark abyss formed beneath their feet; as the fragments are annihilated, usr2 feels parts of their essence being torn away."
        ]
    },
    "healer": {
        "normal": [
            "usr1 waves their hand, and a soft glow envelops usr2, mending minor wounds on their bdypart",
            "With a gentle chant, usr1 calls forth a healing light that bathes usr2, soothing pain and revitalizing their bdypart",
            "usr1 touches usr2's bdypart lightly, and a warm, golden aura spreads from their fingertips, healing small cuts and bruises",
            "usr1 raises a staff, and a shower of sparkling light descends upon usr2, promoting the healing of their bdypart",
            "usr1 murmurs an incantation, causing a wave of restorative energy to wash over usr2, easing aches in their bdypart",
            "A serene smile from usr1 precedes a gentle touch on usr2's bdypart, where a soothing warmth spreads, knitting tissues together",
            "usr1 focuses their energy, creating a healing mist that surrounds usr2, accelerating the recovery of their bdypart",
            "usr1 utters a prayer, and a beam of healing light descends from above, enveloping usr2's bdypart in its nurturing glow",
            "usr1 closes their eyes and chants softly, summoning a circle of healing light around usr2 that mends their bdypart",
            "usr1's hands glow with a soft light as they lay them on usr2's bdypart, transferring rejuvenating energy to heal minor wounds"
        ],
        "crit": [
            "usr1 raises their staff high, and a powerful wave of healing energy surges forth, completely revitalizing usr2 and rejuvenating their bdypart",
            "With an intense focus, usr1 channels a burst of divine light that envelops usr2, healing all wounds and filling their bdypart with renewed strength",
            "usr1 chants a powerful incantation, summoning a celestial being that descends and touches usr2, restoring their bdypart to perfect health",
            "A brilliant light emanates from usr1, forming a protective shield around usr2 that not only heals their bdypart but also wards off further harm",
            "usr1's eyes glow with divine power as they release a torrent of healing energy, mending even the most grievous wounds on usr2's bdypart",
            "usr1 draws upon ancient healing magic, causing a radiant pulse to emanate from their hands, fully restoring usr2's bdypart",
            "usr1 whispers a sacred hymn, and a fountain of healing light springs up around usr2, washing over their bdypart and restoring it completely",
            "With a flourish, usr1 casts a grand healing spell that envelops usr2 in a cocoon of light, mending every injury on their bdypart",
            "usr1 channels the energy of the earth itself, sending a wave of restorative power through usr2, revitalizing their bdypart entirely",
            "A divine light surrounds usr1 as they cast a supreme healing spell, bathing usr2 in its glow and completely rejuvenating their bdypart"
        ]
    },
    "cryomancer": {
        "normal": [
            "usr1 gestures, and a chilling wind sweeps towards usr2, frosting over their bdypart with a cold bite.",
            "With a swift motion, usr1 conjures a barrage of small ice shards that fly towards usr2, peppering their bdypart with frost.",
            "usr1 stomps the ground, causing spikes of ice to shoot up in a line towards usr2, grazing their bdypart with sharp, cold edges.",
            "The air around usr1 crackles with frost as they direct a concentrated beam of cold towards usr2, encasing their bdypart in ice.",
            "usr1 draws a frost rune in the air; moments later, a cold snap freezes the area around usr2, chilling their bdypart significantly.",
            "With a flick of their wrist, usr1 sends a swirling snowstorm towards usr2, buffeting their bdypart with biting winds and ice.",
            "usr1 claps their hands together, and a circle of frost rapidly expands from beneath their feet, catching usr2's bdypart in a freezing grip.",
            "The ground beneath usr2 suddenly frosts over as usr1 manipulates the moisture in the air, making their bdypart slip and slow from the ice.",
            "usr1's breath turns visibly frosty as they exhale a stream of icy mist, which solidifies slightly on contact with usr2's bdypart.",
            "A subtle nod from usr1 causes the temperature around usr2 to plummet, icicles forming and lightly jabbing at their bdypart."
        ],
        "crit": [
            "usr1 channels their deepest cold fury, causing a giant ice spike to erupt from the ground directly under usr2, impaling their bdypart with brutal precision.",
            "With intense concentration, usr1 summons a razor-sharp icicle in mid-air and sends it flying straight into usr2's bdypart, impaling it deeply.",
            "usr1 forms a circle of ice spikes around usr2, which then close in rapidly, impaling their bdypart from multiple directions with lethal cold.",
            "In a display of raw power, usr1 causes the moisture in the air around usr2 to flash-freeze, forming a spear of ice that impales their bdypart.",
            "usr1 throws their hand forward, launching a barrage of large ice shards that converge on usr2, one of which impales their bdypart significantly.",
            "A loud cracking sound precedes the formation of a massive ice wall, from which a single, large shard breaks off and impales usr2's bdypart.",
            "usr1 lifts both hands to the sky, and from the falling snow, sharp icicles form and plummet, with one large one impaling usr2's bdypart.",
            "With a swirling motion, usr1 gathers the cold around them into a dense, sharp icicle that spirals towards usr2, impaling their bdypart.",
            "usr1's eyes glow a fierce blue as they direct a focused beam of ice that quickly solidifies into a long spike, impaling usr2's bdypart.",
            "usr1 performs an ancient cryomantic chant, resulting in a sudden hailstorm of pointed ice shards, one of which impales usr2's bdypart with fatal accuracy."
        ],
        "minicrit": [
            "The icicle impaling usr2 suddenly explodes, sending shards of sharp ice in all directions, causing additional lacerations around the wound.",
            "After impaling usr2, the ice shard bursts violently, peppering usr2's area with icy shrapnel that digs into their bdypart and surrounding area.",
            "The impaled icicle within usr2's bdypart detonates, the explosion of cold intensifying the pain and causing frost to spread across their body.",
            "Upon impact, the ice shard in usr2's bdypart undergoes a rapid thermal shock, exploding and causing additional damage from the shattering ice.",
            "usr1 gestures again, causing the impaled icicle to vibrate intensely before it shatters explosively, increasing the wound's severity.",
            "The icicle stuck in usr2's bdypart reacts to a sudden drop in temperature, expanding rapidly and exploding, sending chilling fragments flying.",
            "usr1 claps their hands, triggering the icicle to combust into an icy explosion, dramatically increasing the chill and damage to usr2's bdypart.",
            "As usr2 attempts to move, the icicle embedded in their bdypart bursts apart, the fragments causing secondary injuries as they spread.",
            "usr1's eyes narrow as they focus on the impaled icicle, causing it to crackle and then explode, multiplying the pain and damage to usr2's bdypart.",
            "With a flick, usr1 causes the icicle within usr2's bdypart to burst, the sudden explosion of ice echoing like a fracture, spreading cold and shards outward."
        ]
    },
    "fogwalker": {
        "normal": [
            "usr1 gestures, and a swirling mist begins to envelop usr2, lightly obscuring their vision and chilling their bdypart.",
            "With a smooth motion, usr1 summons a dense cloud of fog that rolls towards usr2, dampening their bdypart and reducing visibility.",
            "usr1 claps their hands, and a sudden puff of fog bursts forth, wrapping around usr2's bdypart, leaving them disoriented.",
            "The air around usr1 thickens with fog as they direct a creeping mist to surround usr2, slowly chilling their bdypart.",
            "usr1 draws a symbol in the air; moments later, a cold fog descends directly over usr2, clinging to their bdypart and reducing their speed.",
            "With a whisper, usr1 causes the ground fog to rise, swirling around usr2's bdypart, making every movement feel heavier.",
            "usr1 spins, gathering surrounding mist into a swirling vortex that rushes towards usr2, enveloping their bdypart in a dense, cold fog.",
            "The ground beneath usr2 becomes a source of fog as usr1 manipulates the moisture, causing a sudden upsurge that cools and slows usr2's bdypart.",
            "usr1's breath turns visibly dense as they exhale a stream of fog, which solidifies slightly on contact with usr2's bdypart, numbing it.",
            "A subtle nod from usr1 lowers the ambient temperature, causing the natural moisture to turn into fog that seeps into usr2's clothing, chilling their bdypart."
        ],
        "crit": [
            "usr1 channels their deepest reserves, causing a giant wave of thick fog to engulf usr2, then sharply contracts, squeezing and hurting their bdypart before usr1 absorbs the fog to regenerate.",
            "With intense focus, usr1 summons a razor-sharp wall of fog that slices through the air towards usr2, cutting into their bdypart before the Fogwalker absorbs the fog back, healing their own wounds.",
            "usr1 forms a circle of dense fog around usr2, which then rapidly compresses, trapping and squeezing their bdypart painfully before usr1 draws the fog back, using it to replenish their energy.",
            "In a display of power, usr1 causes the moisture in the air around usr2 to condense into a spear of fog that impales their bdypart, then retracts back to usr1, aiding in their recovery.",
            "usr1 throws their hands forward, launching a barrage of fog darts that pierce usr2's bdypart, each dart then returning to usr1, carrying energy that aids in their healing.",
            "A loud hissing sound precedes the formation of a fog serpent, which wraps around usr2, constricting their bdypart before the fog flows back to usr1, mending their own injuries.",
            "usr1 lifts both hands to the sky, causing a rain of fog droplets to harden and pelt usr2, focusing on their bdypart; afterwards, the fog gathers back to usr1, closing their wounds.",
            "With a swirling motion, usr1 gathers the surrounding mist into a dense, sharp spike that shoots towards usr2, impaling their bdypart, then the mist dissolves and flows back to heal usr1.",
            "usr1's eyes emit a faint glow as they direct a focused beam of fog that solidifies and strikes usr2's bdypart, after which it dissipates and the residual energy heals usr1.",
            "usr1 performs an ancient chant, resulting in a sudden storm of icy fog shards, bombarding usr2's bdypart; each shard then returns to usr1, restoring their vitality."
        ]
    },
    "tidal mage": {
        "normal": [
            "usr1 gestures toward usr2, and a whip-like stream of water lashes out, striking their bdypart with a cold splash.",
            "With a sweeping motion, usr1 summons a surge of water that flows rapidly towards usr2, drenching their bdypart and chilling them to the bone.",
            "usr1 claps their hands together, and a bubble of water forms around usr2's bdypart, briefly encapsulating and disorienting them.",
            "The ground beneath usr2 becomes wet and slippery as usr1 manipulates the moisture, causing a sudden upsurge that splashes aggressively at their bdypart.",
            "usr1's hands glow blue as they draw a circle in the air; moments later, a torrential downpour focuses above usr2, soaking their bdypart heavily.",
            "With a flick of their wrist, usr1 directs a stream of water to coil around usr2's bdypart, tightening and increasing the pressure momentarily.",
            "usr1 spins, gathering moisture from the air into a swirling water spout that moves towards usr2, engulfing their bdypart in a spinning column of water.",
            "A subtle nod from usr1 causes the dew on nearby plants to rise and form droplets, which fly towards usr2, pelting their bdypart with pinpoint accuracy.",
            "usr1 exhales a misty breath, which rapidly condenses into a sharp icicle in mid-air before melting into water that splashes violently on usr2's bdypart.",
            "The air around usr2 chills as usr1 summons a cold blast of water vapor, which condenses suddenly and drenches their bdypart, numbing it with the cold."
        ],
        "crit": [
            "usr1 chants deeply, and a massive wave rises from the ground, crashing over usr2 with devastating force, drenching and overwhelming their bdypart.",
            "With intense concentration, usr1 creates a vortex of swirling water around usr2, which tightens and crushes their bdypart with hydrostatic pressure.",
            "usr1's hands form a peak, and from this focal point, a spear of ice forms and shoots towards usr2, impaling their bdypart with frozen precision.",
            "In a display of raw power, usr1 summons a torrential rain that becomes localized around usr2, turning into a deluge that floods and damages their bdypart.",
            "usr1 throws their hand upward, causing a geyser of boiling water to erupt directly beneath usr2, scalding their bdypart with intense heat.",
            "usr1 slams the ground, causing ice shards to erupt all around usr2, with one large shard striking and impaling their bdypart critically.",
            "With a thunderous roar, usr1 manipulates the atmospheric pressure, causing a sudden, intense downpour that focuses solely on usr2's bdypart, hitting it hard.",
            "usr1 whispers a command, causing the water in the air around usr2 to freeze suddenly, encasing their bdypart in a block of ice that causes frostbite.",
            "A rapid swirl of their staff allows usr1 to summon a circling torrent of water that tightens quickly around usr2, squeezing and soaking their bdypart violently.",
            "usr1 gestures fiercely towards the sky, causing multiple lightning-charged raindrops to fall, each striking usr2's bdypart with electrically charged water."
        ],
        "overflow": [
            "As usr1 reaches their limit, the accumulated water power bursts forth, enveloping them in a healing aura that restores their energy while splashing residual water onto usr2.",
            "The overflow causes usr1 to emit a pulsating wave of water, which heals their wounds and sends additional waves crashing towards usr2, hitting their bdypart.",
            "Excess water energy from usr1 becomes a protective shield that bursts, releasing a refreshing spray that rejuvenates usr1 while soaking usr2 further.",
            "Overheating, usr1's body radiates intense heat, vaporizing surrounding moisture which then condenses, healing them and sending steam towards usr2.",
            "The build-up of hydro energy within usr1 results in a burst of cleansing water that washes over them, healing their wounds and causing splash damage to usr2's bdypart.",
            "usr1's control slips as they release a torrential overflow of energy, rejuvenating themselves while flooding the area around usr2, hindering their movement.",
            "In a sudden release of power, usr1 generates a healing monsoon that recovers their own health and soaks usr2, causing mild hypothermia as the chilling waters envelop them.",
            "As the overflow reaches its peak, usr1's magic causes the nearby water sources to surge and swirl, providing them with a rejuvenating bath of energy while drenching usr2.",
            "usr1 manipulates the overflow to form a cascading waterfall around them, which heals and shields them from damage while splashing over to usr2, soaking their bdypart with relentless force.",
            "The intense buildup of water energy causes usr1 to radiate a pulse of restorative mist, healing themselves significantly and leaving usr2 drenched and slightly disoriented."
        ]
    },
    "dune wizard": {
        "normal": [
            "usr1 swirls their hands, summoning a gust of wind laden with sand that scrapes across usr2's bdypart, abrading the surface.",
            "With a stomp, usr1 causes the ground beneath usr2 to shift, creating quicksand that momentarily traps their bdypart, slowing movement.",
            "usr1 casts a spell, causing a small sandstorm to whirl around usr2, sand grains pelting their bdypart with persistent irritation.",
            "The air around usr1 shimmers with heat as they direct a wave of scorching desert air towards usr2, drying and heating their bdypart uncomfortably.",
            "usr1 draws a symbol in the sand; moments later, a column of compacted sand rises sharply beneath usr2, jarring their bdypart with a sudden impact.",
            "With a flick of their wrist, usr1 sends a swirling vortex of fine sand to encircle usr2, exfoliating their bdypart with a gritty touch.",
            "usr1 claps their hands together, and a spray of coarse sand blasts forward, striking usr2's bdypart and leaving scratches.",
            "The ground beneath usr2 erupts as usr1 manipulates the earth, sending a spout of sand up that envelops and disorients usr2's bdypart.",
            "usr1 whispers an incantation, causing the shadows to stir and sand to rise, forming a sandy claw that grabs at usr2's bdypart.",
            "With a subtle gesture, usr1 causes the ambient moisture around usr2 to evaporate, leaving their bdypart parched and covered in a fine layer of dust."
        ],
        "crit": [
            "usr1 chants deeply, and a massive sand wave rises from the ground, engulfing usr2 with overwhelming force, grinding against their bdypart with crushing pressure.",
            "With intense concentration, usr1 summons a giant sand fist from the earth, which rockets towards usr2 and pummels their bdypart with devastating force.",
            "usr1's hands form a peak, and from this point, a spear of hardened sand shoots towards usr2, impaling their bdypart with deadly precision.",
            "In a display of power, usr1 causes the desert sands to whirl violently around usr2, forming a sand cyclone that abrades and damages their bdypart severely.",
            "usr1 throws their hands upward, causing a geyser of boiling sand to erupt directly beneath usr2, scalding and embedding grains into their bdypart.",
            "usr1 utters a powerful command, and the earth beneath usr2 heaves, launching a barrage of sand spikes that perforate and tear their bdypart.",
            "A torrential sandstorm is summoned by usr1, focusing its fury on usr2, sandblasting their bdypart with a force that strips flesh from bone.",
            "usr1 crafts a swirling sand blade in mid-air, slashing it towards usr2, which cuts through their bdypart with a keen, sandy edge.",
            "The sands around usr2 levitate and compress into a dense, sharp-edged boulder that usr1 hurls, impacting their bdypart with brutal force.",
            "usr1 conjures a mirage that disorients usr2, followed by a real and violent burst of sand that bombards their bdypart, causing deep abrasions."
        ],
        "mega-crit": [
            "As usr1 unleashes their full power, the entire area turns into a blistering sandstorm. Sand whips through the air at lethal speeds, striking usr2 multiple times and devastating their bdypart with relentless ferocity.",
            "usr1 commands the sands to compress around usr2, suddenly tightening with such force that it crushes their bdypart, leaving nothing but a mangled trace.",
            "With a roar, usr1 lifts both hands, and the ground beneath usr2 transforms into a swirling sand vortex, pulling them down and then violently ejecting them, shattered and broken.",
            "usr1's eyes flash white as they summon a colossal sand dragon from the desert floor, which sweeps usr2 off their feet and crushes their bdypart in its jaws.",
            "The sands around usr2 animate into countless serpents, each one striking swiftly and venomously, leaving usr2 paralyzed and their bdypart riddled with wounds.",
            "usr1 evokes an ancient desert curse, causing the sand beneath usr2 to explode upwards in a deadly pillar that impales and grinds their bdypart.",
            "A deafening boom resonates as usr1 manipulates the air pressure, creating a sandblast that acts like a shotgun blast directly at usr2, devastating their bdypart with brutal impact.",
            "The sand at usr1's command forms into a massive anvil above usr2, dropping swiftly and crushing their bdypart under its immense weight.",
            "usr1 chants ominously, causing the sands to swirl and tighten around usr2, forming a sand cocoon that constricts and crushes their bdypart until it shatters internally.",
            "With a flick of their fingers, usr1 causes the desert sands to rise like a tidal wave, then snap shut over usr2, encapsulating and crushing their bdypart with overwhelming force."
        ]
    },
    "igneous mage": {
        "normal": [
            "usr1 clenches their fist, and the ground beneath usr2 heats up, emitting a small burst of lava that scorches their bdypart.",
            "With a wave of their hand, usr1 causes molten rock to spew forth, splattering near usr2 and singeing their bdypart with hot droplets.",
            "usr1 stamps the ground, causing cracks to form and a flow of lava to stream towards usr2, slowly encroaching on their bdypart.",
            "The air around usr1 shimmers with heat as they direct a spray of molten magma towards usr2, coating their bdypart in a searing layer.",
            "usr1 draws a fiery rune in the air; moments later, a geyser of lava bursts from the ground under usr2, jolting their bdypart with intense heat.",
            "With a flick of their wrist, usr1 sends a wave of superheated rocks toward usr2, pelting their bdypart with burning stones.",
            "usr1 claps their hands together, and a ring of fire erupts from the ground, encircling usr2 and heating their bdypart with extreme temperatures.",
            "The ground beneath usr2 suddenly becomes molten, as usr1 manipulates the earth, causing it to bubble and burn usr2's bdypart.",
            "usr1's eyes glow red as they exhale a breath of volcanic ash, which solidifies slightly on contact with usr2's bdypart, burning and suffocating it.",
            "A subtle nod from usr1 causes the nearby rocks to glow red and melt, the molten lava creeping towards usr2 and enveloping their bdypart in heat."
        ],
        "crit": [
            "usr1 raises their arms, and a massive spire of obsidian shoots from the earth directly beneath usr2, impaling their bdypart with molten rock.",
            "With intense focus, usr1 creates a large orb of magma above usr2, which bursts and showers them with molten rock, severely burning their bdypart.",
            "usr1 forms a circle of lava around usr2, which then rapidly rises and closes in, trapping and burning their bdypart with unrelenting heat.",
            "In a display of power, usr1 causes the ground all around usr2 to turn into lava, swallowing their bdypart in a pool of molten earth.",
            "usr1 snaps their fingers, and the air around usr2 ignites into a flaming vortex, searing their bdypart with intense flames and ash.",
            "usr1 gestures towards usr2, summoning a wave of molten lava that sweeps over the ground, engulfing their bdypart and leaving it charred.",
            "With a powerful incantation, usr1 causes the very stones to heat up around usr2, bursting into flame and burning their bdypart severely.",
            "usr1 summons a series of fiery whips made of lava that lash out at usr2, wrapping around their bdypart and scorching it deeply.",
            "A stomp by usr1 triggers an eruption of small volcanic vents around usr2, each spewing molten lava directly at their bdypart.",
            "usr1 channels a fiery aura, then releases it in a sudden burst that sends a shockwave of molten rock hurtling towards usr2, burning their bdypart extensively."
        ],
        "mega-crit": [
            "As usr1 channels their deepest connection to the earth's core, the ground beneath usr2 erupts, opening a fissure that spews lava violently, engulfing usr2 and decimating their bdypart with catastrophic heat.",
            "usr1 summons a meteor shower of molten rocks that rain down on the battlefield, each strike targeted at usr2, melting and reshaping the ground around their bdypart.",
            "With a thunderous roar, usr1 causes the volcanic forces at their command to explode, sending a devastating wave of lava that covers a wide area, focusing particularly on incinerating usr2's bdypart.",
            "usr1's command of magma reaches its peak, causing the earth beneath usr2 to open up and swallow them into a pool of fiery lava, burning their bdypart beyond recognition.",
            "The air itself seems to combust as usr1 gestures wildly, causing explosive geysers of lava to shoot from the ground directly under usr2, enveloping and trapping their bdypart in molten stone.",
            "usr1 conjures an inferno of swirling lava that forms a massive tornado around usr2, trapping them in a cyclonic blaze that sears their bdypart with unrelenting heat and force.",
            "With a dramatic sweep of their arms, usr1 rips open a rift in the ground, from which a blast of volcanic ash and lava surges up, completely enveloping usr2 and causing severe burns to their bdypart.",
            "usr1's eyes flare with intense heat as they summon a barrage of flaming rocks, each one superheated and targeted with deadly accuracy, pelting usr2's bdypart and surrounding them with a fiery cage.",
            "In a moment of peak magical fury, usr1 causes the landscape itself to transform, turning the terrain around usr2 into a boiling lava field, trapping and burning them with no escape.",
            "usr1 invokes the ancient power of the earth's mantle, causing a series of explosive volcanic eruptions directly beneath usr2, each blast more intense than the last, devastating their bdypart and the area around them."
        ]
    },
    "mineral mage": {
        "normal": [
            "usr1 gestures and a cluster of small, sharp crystals shoots from the ground toward usr2, scratching their bdypart lightly.",
            "With a tap of their staff, usr1 causes the earth beneath usr2 to harden and sprout a jagged mineral formation, jolting their bdypart.",
            "usr1 flicks their wrist, and a swirl of dust and tiny gem shards encircles usr2, grazing their bdypart with a shimmering abrasion.",
            "The ground around usr1 glimmers briefly before a wave of crystalline shards bursts forth, skimming usr2's bdypart and leaving small cuts.",
            "usr1 draws a symbol in the air, and moments later, a ring of reflective quartz crystals rises around usr2, dazzling and slightly cutting their bdypart.",
            "With a clench of their fist, usr1 commands the silica in the soil to crystallize and shoot small spikes towards usr2, nicking their bdypart.",
            "usr1 swings their arm, directing a sharp ridge of gypsum to thrust upward under usr2, scraping their bdypart as it emerges.",
            "The air crackles with energy as usr1 summons a burst of crystal dust, which envelops usr2, scratching and irritating their bdypart.",
            "usr1 whispers an incantation, causing the shadows around usr2 to harden into dark crystal claws that reach out and scrape their bdypart.",
            "With a sweeping gesture, usr1 causes the ground beneath usr2 to shimmer and erupt with a spray of mica flakes, buffeting their bdypart with gritty layers."
        ],
        "crit": [
            "usr1 chants powerfully, and a massive crystal obelisk suddenly emerges from beneath usr2, impaling their bdypart with brutal precision.",
            "With intense concentration, usr1 manipulates the deep earth minerals, causing a surge of sharp, heavy boulders to roll towards usr2, striking their bdypart hard.",
            "usr1's hands glow, and from the ground, a series of large, pointed amethyst spikes shoot up around usr2, encircling and piercing their bdypart.",
            "In a display of raw power, usr1 summons a torrent of jagged rocks that spin around usr2, each one striking and embedding in their bdypart with significant force.",
            "usr1 claps their hands, and the silica in the air condenses into a dense, glass-like shard that flies directly at usr2, slicing deeply into their bdypart.",
            "usr1 gestures toward the sky, causing a cascade of calcite spikes to fall like a hailstorm, bombarding usr2's bdypart with penetrating force.",
            "With a stomp, usr1 causes the earth to split, and from the fissure, a sharp jet of crystalline material erupts, targeting and slicing into usr2's bdypart.",
            "usr1 waves their hand, pulling strands of mineral-rich soil that weave into a solid lattice and crash into usr2's bdypart, fracturing on impact.",
            "usr1 channels their power into the ground, causing a sudden eruption of needle-like crystal shards that shoot upward, skewering usr2's bdypart from below.",
            "With an arcane whisper, usr1 conjures an array of mineral blades that whirl in a deadly dance around usr2, slicing into their bdypart with lethal precision."
        ],
        "mega-crit": [
            "As usr1 unleashes their full power, the ground below usr2 erupts, opening a fissure that spews lava violently, engulfing usr2 and decimating their bdypart with catastrophic heat.",
            "usr1 summons a meteor shower of molten rocks that rain down on the battlefield, each strike targeted at usr2, melting and reshaping the ground around their bdypart.",
            "With a thunderous roar, usr1 causes the volcanic forces at their command to explode, sending a devastating wave of lava that covers a wide area, focusing particularly on incinerating usr2's bdypart.",
            "usr1's command of magma reaches its peak, causing the earth beneath usr2 to open up and swallow them into a pool of fiery lava, burning their bdypart beyond recognition.",
            "The air itself seems to combust as usr1 gestures wildly, causing explosive geysers of lava to shoot from the ground directly under usr2, enveloping and trapping their bdypart in molten stone.",
            "usr1 evokes an ancient desert curse, causing the sand beneath usr2 to explode upwards in a deadly pillar that impales and grinds their bdypart.",
            "usr1 raises their hands, and the very rocks around usr2 resonate and shatter into countless sharp fragments, which then home in on and perforate usr2's bdypart with devastating accuracy.",
            "With a powerful chant, usr1 causes the earth to tremble and split, from which a titanic crystal bursts forth, impaling usr2 with such force that it sends shockwaves throughout the surrounding area.",
            "usr1 manipulates the subterranean pressures to create a sudden upsurge of crystalline spikes directly under usr2, lifting them off the ground before the spikes shatter explosively, sending lethal shards in all directions.",
            "usr1 conjures a storm of razor-sharp crystal shards that whirl around usr2 in a blinding, slicing cyclone, relentlessly cutting into their bdypart until it collapses under the sheer intensity."
        ]
    },
    "psychic": {
        "normal": [
            "usr1 focuses intently, sending a subtle wave of psychic energy towards usr2 that causes a slight headache, affecting their bdypart.",
            "With a flick of their fingers, usr1 projects a mild telekinetic force that nudges usr2, disorienting them and lightly jarring their bdypart.",
            "usr1's eyes glow briefly as they whisper a mental command, causing usr2 to momentarily forget their next move, confusing their thoughts.",
            "The air around usr1 shimmers with psychic energy as they direct a pulsing wave towards usr2, inducing a brief but intense sensation of vertigo that impacts their bdypart.",
            "usr1 draws a symbol in the air that resonates with psychic power; moments later, usr2 feels an inexplicable dread that unsettles their bdypart.",
            "With a clench of their fist, usr1 sends a burst of psychic noise into usr2's mind, causing distracting whispers that echo painfully in their bdypart.",
            "usr1 hums a dissonant tune, creating sound waves that resonate with usr2's mental frequencies, slightly shaking their bdypart with a resonant frequency.",
            "The ground beneath usr2 doesn't move, but usr1 manipulates their perception to feel as if it is quaking, destabilizing their stance and affecting their bdypart.",
            "usr1's gestures cause the shadows to appear menacing, playing tricks on usr2's mind and causing a chilling effect on their bdypart.",
            "A subtle nod from usr1 triggers an invisible, psychic slap that fleetingly contacts usr2's bdypart, leaving them momentarily puzzled and off-balance."
        ],
        "crit": [
            "usr1 channels deep into the recesses of their psychic power, unleashing a devastating mental blast that fractures usr2's psyche, causing intense pain and disarray within their mind and bdypart.",
            "With intense focus, usr1 penetrates usr2's mental defenses and instills a powerful psychic scream that echoes in their mind, shattering their cognitive abilities and causing their bdypart to seize up.",
            "usr1's eyes flash as they project a horrifying mental image directly into usr2's thoughts, overwhelming their psyche and causing their bdypart to react violently with spasms.",
            "In a display of psychic mastery, usr1 sends a wave of mental turbulence that ripples through usr2's consciousness, disrupting their sense of reality and physically jolting their bdypart.",
            "usr1 constructs a complex psychic trap that, when triggered by usr2, collapses their mental barriers and sends excruciating shockwaves through their bdypart.",
            "usr1 emits a concentrated beam of psychic energy that pierces through usr2's mental defenses, inducing a crippling migraine that radiates painfully across their bdypart.",
            "With a series of rapid, intricate hand gestures, usr1 crafts a psychic labyrinth around usr2's mind, trapping them in a loop of mental anguish that debilitates their bdypart.",
            "usr1 summons a spectral manifestation of usr2's deepest fears, which materializes before them and attacks, breaking their spirit and causing severe distress to their bdypart.",
            "A sudden intensification of psychic energy allows usr1 to momentarily take control of usr2's motor functions, forcing them to harm their own bdypart.",
            "usr1 unleashes a psychic pulse that resonates specifically with usr2's neural frequencies, causing a synaptic overload that disrupts their entire nervous system and severely impacts their bdypart."
        ]
    },
    "proficient_scholar": {
        "normal": [
            "usr1 deciphers a complex algorithm written in an ancient cipher, each symbol unlocking deeper layers of knowledge.",
            "In the dim light of early morning, usr1 examines a rare collection of astrological instruments, understanding their unique mechanisms.",
            "usr1 cross-references multiple historical sources simultaneously, constructing a more accurate timeline of an ancient empire's rise and fall.",
            "Amidst the silence of the university's special collections room, usr1 pores over a first-edition manuscript detailing esoteric magical practices.",
            "usr1 uses advanced spectroscopy to analyze the ink on a medieval map, discovering hidden annotations left by a famous explorer.",
            "In a secure archive, usr1 carefully examines the personal diary of a notable historical figure, uncovering new insights about key political events.",
            "usr1 collaborates with international experts via a virtual conference, discussing theories about the symbiotic relationships between magical creatures and humans.",
            "With a VR headset, usr1 immerses themselves in a 3D reconstruction of an ancient battlefield, analyzing tactics and strategies employed by forgotten armies.",
            "usr1, equipped with noise-canceling headphones, listens to restored audio recordings of ancient chants, deciphering their use in historical ceremonies.",
            "In an intense study session, usr1 uses chemical analysis to reveal the secret composition of inks used in Renaissance paintings, uncovering lost artistic techniques."
        ],
        "crit": [
            "With a sudden realization, usr1 cracks the code of an arcane mathematical theorem that explains the patterns of magical energy flows across the globe.",
            "usr1's meticulous analysis of a Pharaoh's tomb inscriptions reveals a hidden chamber not detected by previous explorations, rewriting the history books.",
            "While reconstructing a shattered ancient tablet, usr1 discovers a set of laws that governed inter-dimensional travel in antiquity.",
            "During a heated scholarly debate, usr1 presents irrefutable evidence that links a mythical artifact to historical figures of great power.",
            "usr1 synthesizes knowledge from various ancient cultures, creating a unified theory of elemental magic that surpasses all known teachings.",
            "In a breakthrough paper, usr1 details the genetic lineage of mythical beasts, proving their existence and contemporary descendants.",
            "usr1 uncovers a conspiracy hidden within medieval legal documents, shedding light on a secret society that influenced major historical events.",
            "By aligning astrological and geological data, usr1 predicts a soon-to-occur natural phenomenon that could prove the reality of earth magic.",
            "In a rare book, usr1 finds a forgotten philosophical discourse that offers solutions to modern ethical dilemmas regarding magic and technology.",
            "While restoring a faded mural, usr1 deciphers an allegory illustrating the use of psychic abilities in governance, offering new insights into ancient leadership."
        ]
    },
    "spirit blade": {
        "normal": [
            "usr1 meditates briefly before their blade begins to glow with a spectral light, and they swiftly strike at usr2, the blade's trail chilling the air as it passes near their bdypart.",
            "With a fluid motion, usr1 draws their spirit blade, which hums with energy, and slashes through the air, sending a wave of force towards usr2's bdypart.",
            "usr1 chants an ancient invocation, enhancing their blade with spiritual fire that casts eerie shadows as they swing at usr2's bdypart.",
            "The ground trembles lightly as usr1 plants their blade into the earth, summoning a burst of spiritual energy that shoots towards usr2, targeting their bdypart.",
            "usr1 performs a series of precise, graceful movements with their blade, each motion releasing a faint, spectral wisp that brushes against usr2's bdypart.",
            "With a whisper, usr1's blade arcs with a trail of blue flames, and they execute a spinning attack that lightly scorches usr2's bdypart.",
            "usr1's blade pulses with a ghostly light as they dash forward, delivering a rapid strike that leaves usr2's bdypart tingling with spiritual energy.",
            "As usr1 raises their blade, it emits a sonorous ring that resonates through the air, briefly disorienting usr2 before the blade slashes at their bdypart.",
            "usr1's spirit blade flickers with shadowy tendrils, and with a sweeping cut, they unleash a dark wave that sweeps towards usr2's bdypart.",
            "With focused intent, usr1 performs a powerful overhead strike, their blade momentarily splitting into three spectral copies that simultaneously strike at usr2's bdypart."
        ],
        "crit": [
            "usr1's spirit blade sings with power, and as they thrust forward, the blade pierces through dimensions, striking usr2's bdypart with a force that echoes through their very soul.",
            "In a brilliant flash of light, usr1's blade channels the spirits of ancient warriors, delivering a devastating slash that seems to cut through time itself, grievously wounding usr2's bdypart.",
            "With a roar, usr1 swings their blade in a wide arc; as it connects with usr2, a burst of spiritual energy is released, causing severe disruptions to both the physical and etheric bodies of usr2.",
            "usr1 leaps high into the air, their blade crackling with divine energy, and strikes down upon usr2 with such force that the impact creates a shockwave, stunning and heavily damaging their bdypart.",
            "A deep, resonant vibration emanates from usr1's blade as they execute a precise, deadly strike that resonates with usr2's spiritual essence, severely disrupting their life force.",
            "usr1's blade glows with a fierce, otherworldly light as they deliver a strike that cleaves through the air, sending a slicing wave of spiritual energy towards usr2's bdypart, cutting deep into their essence.",
            "With a silent command, usr1's blade bursts into spectral flames, and as they swing, the flames engulf usr2, burning both physically and spiritually, leaving deep, searing wounds on their bdypart.",
            "usr1 executes a series of rapid, blindingly fast strikes, each one leaving trails of shimmering spiritual energy that converge on usr2's bdypart, causing profound psychic trauma.",
            "The air chills as usr1's blade absorbs ambient spiritual energy, releasing it in a single, devastating thrust that pierces usr2's bdypart with icy precision, freezing the surrounding ether.",
            "usr1 channels the fury of the storm into their blade, and with a thunderous clash, the strike unleashes a torrent of spiritual energy that overwhelms usr2's bdypart, ravaging it with both wind and spirit."
        ]
    },
    "shogun": {
        "normal": [
            "usr1 brandishes their katana with precision and grace, striking at usr2 with a technique that reflects years of disciplined training, slightly grazing their bdypart.",
            "With a swift and silent step, usr1 advances on usr2, their blade slicing through the air with a sound like a whisper, barely touching usr2's bdypart but leaving a mark.",
            "usr1 enters a defensive stance, their eyes locked on usr2, and at the perfect moment, they parry an incoming attack and counter with a swift, clean cut to usr2's bdypart.",
            "In a fluid motion, usr1 draws their sword from its sheath and delivers a quick, sharp strike that flicks across usr2's bdypart, demonstrating the art of iaido.",
            "usr1 circles around usr2, katana held high, then strikes down in a powerful arc aimed at usr2's bdypart, the movement smooth and controlled.",
            "With the sun setting behind them, usr1 steps forward and delivers a slicing strike to usr2, the blade's movement casting a long shadow as it nears usr2's bdypart.",
            "usr1's blade glints in the light as they perform a series of precise, elegant cuts, each one aimed at testing usr2's defenses and lightly scoring their bdypart.",
            "In the silence that precedes battle, usr1 unsheathes their katana, the sound sharp and clear, before they advance, delivering a measured strike to usr2's bdypart.",
            "usr1 executes a perfect kendo strike, their blade cutting through the air and landing a controlled, practice-like hit on usr2's bdypart.",
            "With a battle cry, usr1 charges toward usr2, their katana swinging in a wide, horizontal arc that targets usr2's bdypart with practiced lethality."
        ],
        "crit": [
            "In a moment of pure mastery, usr1's blade strikes true and deep, not only wounding usr2's bdypart but also rallying all who witness the strike, their spirits lifted by the display of skill and courage.",
            "usr1 executes a flawless maneuver that ends with their katana deeply embedded in usr2's bdypart; the act is so awe-inspiring that it immediately boosts the morale of their allies, who cheer in unison.",
            "With a decisive slash that resonates through the battlefield, usr1 critically wounds usr2's bdypart, the perfection of the strike serving as a powerful symbol of leadership and bravery to all observers.",
            "usr1's critical hit not only incapacitates usr2 but also serves as a rallying cry for their allies, who are inspired by usr1's indomitable spirit and unmatched prowess.",
            "As usr1's katana connects with usr2's bdypart in a spectacular display of swordsmanship, the critical strike inspires songs and stories among the ranks, bolstering the morale of all who hear them.",
            "usr1 delivers a critical strike that cuts through the air with such force it seems to split the very atmosphere, the sound and sight of which galvanizes their allies into a renewed fervor.",
            "usr1's blade finds a critical gap in usr2's armor, the successful strike boosting the confidence and battle spirit of their entire unit.",
            "With a single, precise movement, usr1's katana disarms usr2 and continues through to strike a critical area, the elegance and effectiveness of the move heartening their comrades.",
            "usr1 performs a swift, powerful slash that critically wounds usr2 and leaves a lasting impression on all onlookers, strengthening their resolve and unity.",
            "The sheer force of usr1's critical strike sends a shockwave across the battlefield, the awe-inspiring power of the blow rallying their troops and striking fear into the hearts of their enemies."
        ]
    },
    "knight": {
        "normal": [
            "usr1 charges across an open field at usr2. For nearly a minute, tense drums echo from the ether, the brave knight appearing to get no closer, so great is the distance between them. Then, with frankly improbable speed, the final gap is closed! usr2 is stabbed in the bdypart! Which sucks, but at least now they don't have to go to that stupid wedding.",
            "In the midst of battle, usr1 suddenly halts, looks around suspiciously, and loudly questions, 'What... is the air-speed velocity of an unladen swallow?' before charging at usr2, catching them off guard and landing a solid hit on their bdypart.",
            "usr1 kneels solemnly, drawing their sword and holding it aloft as a beam of light shines down. Rising with heroic grace, they charge forward, slashing at usr2's bdypart with divine precision.",
            "With a shout of 'For the crown!', usr1 rides forth on their steed, lance poised, and strikes a powerful blow to usr2's bdypart, the impact echoing like thunder across the battlefield.",
            "usr1 parries an incoming blow with a flourish of their sword, retaliating with a swift thrust that pierces usr2's bdypart, their armor clanking melodiously with the movement.",
            "As a fog rolls across the battlefield, usr1 emerges with their banner held high, inspiring their allies before turning to usr2 and delivering a crushing blow to their bdypart with their shield.",
            "usr1 dodges a volley of arrows with surprising agility for someone in full armor, closing the distance and landing a heavy slash across usr2's bdypart.",
            "The ground trembles under the weight of usr1's armored boots as they charge, bellowing a war cry that momentarily stuns usr2 before the knight's sword crashes down onto their bdypart.",
            "In a quiet moment before the storm, usr1 sharpens their blade meticulously, then with a swift motion, charges at usr2, their blade glinting deadly in the sunlight as it finds its mark on usr2's bdypart."
        ],
        "crit": [
            "With a battle-hardened yell, usr1 delivers a masterful strike that cleaves through usr2's defenses, the blade resonating with the sound of splitting metal as it impacts usr2's bdypart.",
            "usr1's blade arcs through the air with deadly precision, finding a weak spot in usr2's armor and driving deep, the impact causing shock and awe among onlookers.",
            "In a powerful display of skill, usr1 spins and delivers a slashing blow that cuts deeply into usr2's bdypart, leaving a wound that will be spoken of in songs of valor.",
            "usr1 executes a daring leap, their sword plunging downward in a devastating attack that pierces through usr2's guard and embeds itself in their bdypart, drawing gasps from all who watch.",
            "With the speed of a striking serpent, usr1's sword finds its mark, the critical strike so precise and forceful that it leaves usr2 staggering from the impact.",
            "usr1 channels years of training into a single, mighty blow that crashes into usr2's bdypart, the force of the attack echoing like thunder across the battlefield.",
            "As the clash of steel rings out, usr1 maneuvers with uncanny agility, their blade slicing through the air and delivering a crippling cut to usr2's bdypart, demonstrating the art of war.",
            "With unerring accuracy, usr1's sword strikes a vital point, the critical hit causing severe damage and leaving usr2 vulnerable and reeling.",
            "usr1's combat prowess shines as they execute a swift, powerful strike that breaks through usr2's defenses and lands heavily on their bdypart, the sound of impact resonating deeply."
        ]
    },
    "sellsword": {
        "normal": [
            "usr1 unsheathes their sword swiftly, the blade gleaming under the sun as they make a quick, testing cut towards usr2's bdypart.",
            "With calculated indifference, usr1 sidesteps an incoming blow, countering with a precise and powerful thrust aimed at usr2's bdypart.",
            "usr1 tightens their grip on the hilt, their eyes calculating as they feint to the left before delivering a sharp jab to usr2's bdypart.",
            "The sound of clashing metal fills the air as usr1 engages usr2, skillfully parrying an attack before responding with a quick slash to their bdypart.",
            "usr1 charges with a low, aggressive stance, suddenly accelerating to deliver a brutal swing aimed directly at usr2's bdypart.",
            "In a fluid sequence of movements, usr1 dodges to the side, rolls forward, and comes up with their blade swinging upward towards usr2's bdypart.",
            "usr1 uses the chaos of the battlefield to their advantage, blending into the melee before emerging just long enough to strike at usr2's bdypart.",
            "With a grunt of effort, usr1 heaves their sword overhead and brings it down in a heavy, cleaving blow that targets usr2's bdypart.",
            "The sellsword’s blade dances with deadly intent, as usr1 maneuvers around usr2's defenses, looking for an opening to exploit and strike their bdypart.",
            "usr1 momentarily locks eyes with usr2, a smirk playing on their lips before they lunge forward, their blade aimed with lethal precision at usr2's bdypart."
        ],
        "crit": [
            "With a roar of battle-lust, usr1 delivers a crushing blow that not only breaks through usr2's guard but also lands with devastating force on their bdypart, sending shockwaves of pain.",
            "usr1's sword strikes with such force that it causes a metallic echo to resonate across the field, the blade embedding deeply into usr2's bdypart, effectively incapacitating them.",
            "The mercenary's cunning is on full display as usr1 feints a retreat then quickly pivots to deliver a piercing strike that critically wounds usr2's bdypart.",
            "Amidst the din of battle, usr1 finds a moment of clarity and unleashes a torrent of strikes, each more precise than the last, culminating in a critical hit that severely damages usr2's bdypart.",
            "With relentless aggression, usr1 overwhelms usr2's defenses, hammering on them until a final, critical slash carves deeply into usr2's bdypart, likely a blow they won’t soon forget.",
            "usr1's technique is flawless as they spin, bringing their blade around in a powerful arc that slices through air and armor alike, landing a critical hit on usr2's bdypart with surgical precision.",
            "In a display of brute strength and skill, usr1 lifts their opponent off their feet with a mighty uppercut using the hilt of their sword, following through with a critical downward slash to usr2's bdypart.",
            "The sellsword's mastery of combat shines as usr1 parries an oncoming blow and counters with a swift, critical thrust that pierces right through usr2's bdypart, leaving them staggering back in pain.",
            "usr1's patience pays off as they bide their time during the duel, finally spotting a lapse in usr2's concentration and exploiting it with a swift, decisive strike that critically hits their bdypart.",
            "As the battle rages, usr1 executes a series of complex maneuvers, each one building on the momentum of the last, culminating in a powerful strike that lands critically on usr2's bdypart, showcasing their skill and precision."
        ]
    },
    "martial artist": {
        "normal": [
            "usr1 assumes a low stance, their eyes locked on usr2 as they deliver a swift, powerful kick aimed at usr2's bdypart, demonstrating their kickboxing skills.",
            "With the agility of a cat, usr1 dodges to the side and counters with a rapid series of jabs and crosses that target usr2's bdypart, each hit marked by precise control.",
            "usr1 suddenly springs forward, using the momentum to execute a spinning back kick that lands solidly against usr2's bdypart, the impact echoing through the street.",
            "The sound of rapid footsteps precedes usr1 as they charge, sliding on the asphalt before rising in a fluid motion to deliver an uppercut aimed directly at usr2's bdypart.",
            "usr1's movements blur, a dance of devastating strikes; they duck under a swing and respond with a powerful elbow strike to usr2's bdypart.",
            "Crouching momentarily, usr1 explodes upwards with a knee strike that targets usr2's bdypart, propelled by the strength of their disciplined training.",
            "usr1 channels their inner calm before unleashing a flurry of precise and hard-hitting punches and kicks, each aimed meticulously at usr2's bdypart.",
            "With a shout that cuts through the noise, usr1 leaps into the air, executing a flying kick that targets usr2's bdypart with deadly accuracy.",
            "usr1 sidesteps a clumsy attack, grabbing usr2's arm and using their momentum to throw them over their shoulder, their technique flawless as usr2 lands hard on the ground.",
            "The street becomes a ring as usr1 circles usr2, suddenly darting in to deliver a chop with the edge of their hand to usr2's bdypart, the strike swift and clean."
        ],
        "crit": [
            "In a display of peak physical condition and training, usr1 delivers a spinning heel kick that connects with usr2's bdypart with such force it sends them spinning to the ground, dazed and disoriented.",
            "usr1 channels years of training into a single, devastating blow; a palm strike that hits usr2's bdypart with explosive power, the shockwave visibly rippling through the air.",
            "With a fierce cry, usr1 performs a double leg sweep that knocks usr2 off their feet, followed by a ground-and-pound that targets usr2's bdypart, leaving them breathless and beaten.",
            "usr1 ducks under a wild punch and counters with a lightning-fast series of strikes, culminating in a critical, bone-jarring knee to usr2's bdypart, clearly demonstrating their mastery of Muay Thai.",
            "As usr2 advances, usr1 utilizes perfect timing to deliver a jumping spinning hook kick that crashes into usr2's bdypart, the impact resounding like a clap of thunder.",
            "usr1 catches usr2's punch in mid-air, twisting to apply a joint lock that abruptly turns into a devastating armbar, forcing usr2 to the ground while targeting their bdypart critically.",
            "The calm before the storm breaks as usr1 unleashes a furious barrage of punches, each one more forceful than the last, the final blow landing with a critical smash to usr2's bdypart.",
            "usr1's shadow seems to flicker as they move with blinding speed, delivering a sequence of high-speed punches and kicks, the last a critical strike to usr2's bdypart that sends them reeling.",
            "Harnessing their chi, usr1 executes a powerful crane kick, which finds its mark on usr2's bdypart with precision and devastating impact, echoing the classic moves of martial arts films.",
            "With a battle-hardened yell, usr1 executes a perfect judo throw, followed immediately by a critical strike delivered with the heel of their hand to usr2's bdypart, incapacitating them momentarily."
        ]
    },
    "underdog": {
        "normal": [
            "usr1 dodges an incoming blow with agility, countering with a quick jab to usr2's bdypart, their movements scrappy but effective.",
            "With a determined look, usr1 blocks a high kick and responds with a solid punch to usr2's bdypart, showcasing their gritty resilience.",
            "usr1, seemingly cornered, finds an opening and delivers a sneaky uppercut to usr2's bdypart, surprising their opponent with their tenacity.",
            "The fight intensifies as usr1 absorbs a few hits, only to retaliate with a rapid succession of body shots aimed at weakening usr2's bdypart.",
            "usr1's scrappy fighting style shows as they weave through usr2's defenses, landing a solid hook to usr2's bdypart, proving they're not easy to put down.",
            "Despite appearing outmatched, usr1 rallies, ducking under a swing to land a critical blow to usr2's bdypart, their spirit unbroken.",
            "usr1 uses their underdog status to their advantage, baiting usr2 into a false sense of security before striking swiftly at usr2's bdypart.",
            "In a display of raw determination, usr1 withstands a powerful blow, then counters with a gritty, punishing strike to usr2's bdypart.",
            "usr1 catches usr2 off-guard with a quick sidestep and a counter-strike to usr2's bdypart, their unpredictable style keeping their opponent on their toes.",
            "Showing their resilience, usr1 shakes off a hard hit and comes back with a vengeance, delivering a sharp knee to usr2's bdypart."
        ],
        "crit": [
            "In a surprising turn of events, usr1 channels their inner strength and delivers a powerful blow to usr2's bdypart, rejuvenating themselves while visibly draining usr2's stamina.",
            "With a burst of unexpected energy, usr1 lands a critical strike that not only impacts usr2's bdypart but also saps their energy, boosting usr1's vigor in the process.",
            "usr1's relentless spirit shines as they execute a stunning combination, culminating in a critical hit that rejuvenates their stamina while usr2 appears increasingly fatigued.",
            "Just when they seem down, usr1 springs back with a revitalizing critical strike to usr2's bdypart, their resilience turning the fight as usr2's energy wanes.",
            "usr1 taps into their resolve, landing a devastating uppercut that not only damages usr2's bdypart but also invigorates usr1, draining usr2's stamina significantly.",
            "The crowd roars as usr1, against all odds, delivers a sweeping leg kick that hits usr2 critically, recharging their own energy while weakening usr2's resolve.",
            "usr1 exploits an opening with a ferocious headbutt that jars usr2, the critical impact rejuvenating usr1 while leaving usr2 staggered and drained.",
            "In a display of pure willpower, usr1 unleashes a flurry of precise strikes, each one landing more powerfully than the last, critically depleting usr2's energy while bolstering their own.",
            "usr1's comeback is marked by a critical, bone-crushing punch that not only hurts usr2's bdypart but also seems to draw the life force from usr2 to strengthen usr1.",
            "usr1 channels their fury into a critical, all-or-nothing throw that flips usr2 onto the ground, simultaneously revitalizing usr1 and sapping the stamina from usr2."
        ]
    },
    "thief": {
        "normal": [
            "usr1 blends into the shadows, moving silently before darting out and delivering a swift strike to usr2's bdypart, then disappearing as quickly as they appeared.",
            "With a light foot and a quicker hand, usr1 picks the perfect moment to dash forward, slipping past usr2's defenses to jab at their bdypart, leaving them bewildered.",
            "The faintest rustle of leaves is the only warning before usr1 appears behind usr2, a quick slice aimed at their bdypart before melting back into the environment.",
            "usr1 uses their agility to navigate the terrain, using verticality to their advantage as they drop from above, landing a quick hit on usr2's bdypart before vaulting away.",
            "In the bustling crowd, usr1 remains unnoticed until the last second, when they close in on usr2, stealing a hit on their bdypart and slipping away into the chaos.",
            "usr1's movements are a blur, using misdirection to confuse usr2, striking at their bdypart from one side, then quickly switching to another angle for a second strike.",
            "Silently, usr1 approaches from behind usr2, their presence undetected until a swift and precise strike lands on usr2's bdypart, the theft of their balance as stealthy as any pickpocket.",
            "usr1 watches patiently, timing their attack perfectly to coincide with a loud noise in the environment, masking their swift strike to usr2's bdypart.",
            "With a deceptive feint, usr1 draws usr2's attention away before delivering a rapid succession of strikes to their bdypart, each hit a whisper.",
            "usr1 maneuvers through the shadows, their approach unseen until a sudden flash of silver signals a quick, effective cut to usr2's bdypart."
        ],
        "crit": [
            "In a moment of perfect opportunity, usr1's attack from the shadows not only hits its mark on usr2's bdypart but also disorients them, leaving them vulnerable and exposed.",
            "usr1 executes a daring roll under usr2's guard, coming up with a critical, stunning stab to the bdypart that leaves usr2 reeling from the unexpected ferocity.",
            "With exceptional timing, usr1 slips through usr2's defense, delivering a sharp, critical strike to the bdypart that causes significant disorientation and pain.",
            "usr1 capitalizes on a momentary distraction, landing a critical blow to usr2's bdypart that is so precise and swift, it seems the air itself was cut.",
            "The environment becomes an ally as usr1 uses a sudden shadow to conceal their movement, striking a debilitating, critical blow to usr2's bdypart with practiced ease.",
            "From the darkness, usr1 emerges with a deadly precision, their critical hit on usr2's bdypart not only incapacitating but also quietly demoralizing their foe.",
            "usr1's stealth tactics culminate in a critical strike that hits with the silence of a whisper but the impact of a scream, targeting usr2's bdypart effectively.",
            "As usr2 hesitates, usr1 seizes the moment, delivering a devastating kick to the bdypart, a move so sudden and sharp it leaves usr2 momentarily stunned.",
            "With a flurry of movement too quick to follow, usr1 lands multiple precise hits, the final critical strike to usr2's bdypart leaving a mark that will not soon be forgotten.",
            "usr1 finds a gap in the chaos of combat to deliver a powerful, critical blow that knocks the wind out of usr2, effectively turning the tide of the skirmish."
        ]
    },
    "swashbuckler": {
        "normal": [
            "usr1 brandishes their rapier with a flourish, leaping forward with agile grace to land a quick jab on usr2's bdypart, their movements as theatrical as they are effective.",
            "With a confident smirk, usr1 swings from a nearby rope, boots landing solidly on the ground before delivering a sweeping cut to usr2's bdypart.",
            "usr1 parries an attack with ease, riposting with a stylish thrust that barely grazes usr2's bdypart, their banter as sharp as their blade.",
            "Amid a dazzling display of swordsmanship, usr1 feints left and strikes right, their blade making a swift, precise touch against usr2's bdypart.",
            "usr1 engages usr2 with a series of dramatic, sweeping sword arcs, each movement calculated to test their opponent's defenses and strike at their bdypart.",
            "With the poise of a duelist, usr1 sidesteps an aggressive attack, countering with a rapid slash aimed skillfully at usr2's bdypart.",
            "usr1's laughter rings out as they duck under a clumsy swing, rising to tap usr2's bdypart with the tip of their sword, taunting them with each dodge and weave.",
            "In the heat of battle, usr1 spins, their cloak billowing dramatically, distracting usr2 just long enough to land a quick strike on their bdypart.",
            "usr1 challenges usr2 to a duel with a theatrical bow, then attacks with a series of quick, cunning maneuvers aimed at usr2's bdypart.",
            "The clash of steel rings out as usr1 advances, blade flickering with deceptive speed, touching usr2's bdypart before they can fully react."
        ],
        "crit": [
            "With a flamboyant shout, usr1 signals their pirate ship in the distance; as their blade strikes a critical hit on usr2's bdypart, cannon fire thunders, raining down chaos around them.",
            "As usr1 lands a critical thrust, they spin and throw their arms wide, signaling their crew; moments later, the ground shakes as cannonballs explode nearby, adding mayhem to the critical strike.",
            "With a dramatic flourish, usr1's rapier punctures usr2's bdypart critically; simultaneously, the eerie sound of cannon fire rolls in, and explosive shots pummel the area, shocking all who witness.",
            "usr1's critical hit is punctuated by a loud, roaring blast from their pirate ship's cannons, the impact sending shockwaves through the area as usr2 reels from both the blade and the bombardment.",
            "Right as usr1's blade meets usr2's bdypart in a critical, stylish stab, they give a cunning grin and nod seaward, cueing a devastating cannonade that disrupts the battlefield dramatically.",
            "The air crackles with the smell of gunpowder as usr1's precise slash finds its mark on usr2's bdypart, a signal for their ship to unleash a barrage that blankets the area with explosive fury.",
            "As usr1 expertly parries and returns a thrust, scoring a critical hit, their eyes flick to the horizon; seconds later, the ground near usr2 erupts from cannon shots, adding injury to insult.",
            "With a clever twist of their wrist, usr1 delivers a blow that cuts deeply into usr2's bdypart; almost instantly, the sky darkens with cannonballs, dramatically emphasizing the critical strike.",
            "usr1 dances back from a clash, sword driving critically into usr2's bdypart, as overhead, the ominous boom of cannon fire heralds a storm of iron raining down upon their foe.",
            "As usr1 executes a perfect lunge that critically wounds usr2, they signal with a fierce cry, and the resounding cannonade that follows mirrors the intensity of their attack."
        ]
    }                 
}